[
  {
    "id": "369",
    "postid": "369",
    "title": ".When the big blue bus was late",
    "description": "When the big blue bus was late\r\nBy: Penelope Smith, Mango Tree",
    "long_story": "When the big blue bus was late\r\n\r\nOnce a day the big blue bus stops in Bubu's village to pick up people to go to town. Bubu has never seen such a big bus. He counts 9 passenger windows and a window for the driver. \"There must be 9 rows of passenger seats with at least 6 seats in a row,\" Bubu thinks.\r\nIf Bubu is right, how many passengers can the big blue bus carry?\r\n\r\nTomorrow, Bubu's mother will take him to town to buy a new school uniform. She sells eggs for R15 a dozen. Most weeks she makes R450. How many dozen eggs does she need to sell to make R450? For the last 4 weeks, she has been able to save half her money to pay for Bubu's new uniform.\r\nCan you work out how much money she saved in 4 weeks?\r\n\r\nIt's almost three months since Bubu's last bus trip. He cannot wait!\r\nTomorrow is the big day. By seven o'clock, he is in bed, but he can't fall asleep. His mind is racing. He can't stop thinking about the trip to town. It's already half past nine, but Bubu is still wide awake.\r\n\r\nEvery morning, Bubu's mother wakes him at seven o'clock. But today he is already wide awake by six o'clock, even though he only went to sleep at eleven o'clock last night.\r\nBy seven o'clock he is washed and dressed and ready to go. How long did Bubu sleep last night?\r\n\r\nAt quarter to eight Bubu and his mother get to the bus stop. The big blue bus is supposed to arrive by eight o'clock.\r\nBubu's mother checks her watch. The big blue bus is already fifteen minutes late.\"But the bus is always on time. I wonder what the problem is?\" she says.\r\n\r\nSoon more people join them at the bus stop. They also look at their watches and ask why the bus is late. \"It is already nine o'clock. I am going to be late for work!\" says the bald man in the blue suit.\r\nBubu and his mother have been waiting the longest. To Bubu, it feels like hours and hours. But it isn't really. How long have they been waiting?\r\n\r\nBubu is worried. \"Will I ever get my uniform?\" he asks his mother.\r\nBubu works out that the trip to town and back will take about 4 hours. An hour to get there, 2 hours to shop and 1 hour to get back. \"I have a soccer game with my friends at two o'clock. I hope the bus comes soon or we won't make it home in time.\"\r\n\r\nStill they wait. By now Bubu is crying. Two of the people in the queue leave to go home. Others keep checking the time on their watches.\r\n\"Let's be patient. I am sure the bus is coming soon,\" Bubu's mother tells them. \"I want to go home!\" wails Bubu. \"Just another ten minutes,\" she tells him. \"If the bus is not here by half past nine we can go home.\"\r\n\r\nJust then they hear the bus roaring up the road. \"You see I told you,\" Bubu's mother says. \"It's half past nine on the dot. We will do our shopping quickly. If the bus leaves town on time, we will be home before your soccer game.\"\r\nBubu wipes away his tears. His feet are sore. He feels tired. He can't wait to get on the bus.\r\n\r\nTo everyone's surprise, it isn't the big blue bus. It is a little red bus. Bubu counts only 4 passenger windows on the side of the bus. \"Mama,\" says Bubu, \"this is so much smaller than the blue bus. There will never be enough room for all the people going to town.\"\r\nDo you agree with Bubu? Can you guess how many passengers the little red bus can carry?\r\n\r\n\"You worry too much Bubu,\" his mother teases him. \"At least all of us waiting at this stop will get a seat.\"\r\n\"Quick, let's hop on and get the best seats. We've been waiting the longest!\"\r\n\r\nBubu and his mother get on the bus. Behind them are 9 more people in the queue.\"Will there be enough seats for all of us?\" Bubu asks.\r\nHe can see there are 4 rows of seats on the bus, with 2 seats on one side and 2 seats on the other. How many seats are there altogether? Will all the people in the queue be able to sit?\r\n\r\nBubu and his mother take the 2 front seats next to the door. They have lots of space in front of them and a good view outside.\r\nBubu counts 6 new people that have joined the queue.\"That makes 17 passengers altogether,\" he thinks. \"Mama, there's space for almost everyone,\" he tells his mother. \"Only one person will have to stand.\"\r\nDid Bubu count correctly?\r\n\r\nNow the bus is full. The driver closes the doors and pulls off. There is a noise outside. Bubu and the other passengers look out the window.\r\nMore people are running to catch the bus. They shout, \"Stop! Stop! We also need a ride.\" But it is too late. Bubu and his mother feel sorry for the people left behind\r\n\r\nBubu's mother asks the driver, \"Why didn't you come in the big blue bus?\" \"It broke down yesterday,\" he said. \"This small red bus was the only one there was.\"\r\n\"But what about all the people we left behind?\" Bubu's mother asks him. \"Don't worry,\" says the driver, \"I plan to make at least another two trips today.\"\r\nBubu listens as they speak. Numbers are going through his head.\r\n\r\nBubu counts the seats again. \"This bus carries 20 people, 16 sitting and 4 standing.\"\r\n\"I wonder how many trips the bus will have to make to carry 100 passengers to town? What about 200 or 150 passengers?\" he asks himself. Can you work out the answer?\r\nBubu is happy. Soon he'll have his new uniform. Then the bus will take them back home, in time for soccer.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/when_the_big_blue_bus_was_late",
    "pdf_file": "2024/3/when_the_big_blue_bus_was_late.pdf",
    "image_file": "12_06_2024-22_30_19~target001.png",
    "date_stamp": "2024-06-13",
    "likes": "3"
  },
  {
    "id": "368",
    "postid": "368",
    "title": "We live in a manyatta",
    "description": "We live in a manyatta\r\nBy: Nina Orange, Arthur Makali",
    "long_story": "We live in a manyatta\r\n\r\n\r\nPeople live in many different types of homes. Some people live in homes that are built to last a long time. Others live in homes that are temporary and don't last long.\r\nThis book is about a temporary homestead called a manyatta, which is made up of traditional huts.\r\n\r\nThis manyatta is in north-central Kenya, in Samburu County. There are ten huts altogether. Sisters Sidai and Naeku share a hut, and their parents and baby brother share a hut.\r\nTheir uncle and three older brothers stay in the other huts, along with their families.\r\n\r\nThe families graze their cattle together and help each other. They don't stay in one place for very long. They move to find new grazing areas for the cattle.\r\nAround the manyatta is a fence of thorn branches. This fence keeps in the cattle and keeps out strangers.\r\n\r\n\"We begin the building process by collecting materials from our environment. We gather tree branches to build the basic structure of the hut,\" says Sidai.\r\nNaeku adds, \"We know how to use natural materials to create our homes. Everyone in the manyatta helps with building.\"\r\n\r\n\"We use bigger branches to make a strong frame for the walls. We tie the roof frame to the wall frame with climbers, making a sturdy frame for the whole hut,\" explains Sidai.\r\n\"The huts have low roofs, making it harder for the wind to blow them over,\" adds Naeku.\r\n\r\nSidai continues, \"Once the frame of the hut is standing, we weave thin branches in between the thicker branches.\"\r\nNaeku adds, \"We create thick layers of grass and tie them on to the roof frame. This is called thatching.\"\r\n\"Good thatching protects us from rain and sun,\" adds Sidai.\r\n\r\nSidai adds, \"The roofs of our huts can be flat or round.\"\r\nNaeku says, \"Plastering is my favourite part of building. We mix mud and dung to make a natural plaster. We pack this plaster into the wall frame, filling the spaces. This helps to keep out wind and sand.\"\r\n\r\nSidai continues, \"Packing plaster into the walls seals them once those walls are dry. We also plaster the surface of the walls. Dried plaster is hard and strong.\"\r\nNaeku adds, \"There are no windows in the walls, but our hut has a wooden door.\"\r\n\r\n\"Plastering the walls insulates the hut,\" says Sidai. \"What does 'insulate' mean?\" asks Naeku.\r\n\"Mud and dung walls help to keep the hut cool inside when it's hot outside. In cooler weather, the walls help to keep us warm inside by holding in the fire's heat,\" replies her sister.\r\n\r\n\"Everyone in the manyatta helps to build, and we all help to take apart the huts when we move.\r\n\"It's not difficult to take apart the structures and use the parts again in a new place,\" Sidai explains.\r\n\r\n\"Our building materials are light, so it is easy to transport them. We use camels or donkeys to carry any useful materials from our old manyatta. For example, the thatched roof,\" says Sidai.\r\n\"We can also collect more building materials from the environment in the new place,\" adds Naeku.\r\n\r\n\"Our home suits the way that we live, which is to move around with our herds,\" says Sidai.\r\n\"Moving around means we can't always go to school with our friends,\" says Naeku.\r\n\"Our school lets us borrow books, and we try to keep up with schoolwork,\" adds Sidai.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/we_live_in_a_manyatta",
    "pdf_file": "2024/3/pdf/we_live_in_a_manyatta.pdf",
    "image_file": "12_06_2024-22_26_39~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "1"
  },
  {
    "id": "367",
    "postid": "367",
    "title": "Waiting for baby",
    "description": "Waiting for baby\r\nBy: Penelope Smith, Catherine Groenewald",
    "long_story": "Waiting for baby\r\nBy: Penelope Smith, Catherine Groenewald\r\n\r\n\r\nToday is the big day! After 9 months of waiting, Thabi's mother is going to hospital to have her baby. She will be back in 3 days.\r\nCan you read the date and day of the week on the calendar?\r\nWhat will the date be when Thabi's mother comes home?\r\n\r\n\"Bye bye sweetheart!\" Thabi's mother says. \"Please help Dad. I'll be home very soon, with a big surprise for all of us!\"\r\nThe baby has grown so big inside her mother's tummy that Thabi can't get her arms around her like she could before.\r\n\r\nThe taxi is hooting. It is time for her mother to leave. Thabi starts to cry. Her father lifts her up on his shoulders.\r\nShe loves being so high up off the ground like this. She is now at least a whole head taller than her father!\r\nIf Thabi's father is 1,6 metres or 160 centimetres tall. About how far off the ground is Thabi now?\r\n\r\nSoon Thabi is sad again and starts to cry. This is the first time in her life that she and her mother have spent a night apart.\r\nThabi's father puts her down on a chair in front of him. He wipes her tears and speaks softly to comfort her.\r\n\r\nThabi feels brave again, standing tall on her chair. \"I am 6! I am a big girl!\" she tells him.\r\nWhen she stands straight on the chair like this, Thabi is about the same height as her father. Do you remember how tall he is?\r\nHow tall do you think Thabi is, when she stands on the floor not the chair?\r\n\r\nThabi only has to wait for three days from Wednesday to Saturday, but to her it feels like years. Thabi tries to work out how many hours she has to wait.\r\nShe knows there are 24 hours in one day, so she says to herself, \"24 + 24 + 24 is_____.\"\r\nDo you know what the answer is?\r\n\r\n\"Dad,\" Thabi says. \"I thought I was your baby! That is what you always call me. What will happen now? Will I stop being your baby?\"\r\n\"You will always be our special first born child, Thabi,\" her father tells her.\r\n\r\nDad answers many questions about the new baby. Then he has an idea. \"Why don't you write Mom a letter? You can tell her how much you miss her and ask her more questions about the baby.\"\r\n\"I would love to, Dad. Please will you help me?\"\r\n\r\nAfter lunch, Thabi's father helps her to write the letter to her mother. Read Thabi's letter: Dear Mom,\r\nI love and miss you! Daddy says you will be home on Saturday. I can't wait to see you and the new baby.\r\nI have so many questions. Is our baby a boy or a girl? Will it look like me? When will our baby start to walk or talk?\r\nLove from\r\nThabi, your big baby.\r\n\r\nWhen she has finished writing her letter, Thabi starts to daydream.\r\n\"Maybe there are two babies.\" Thabi thinks to herself. \"Twins like some of my friends.\" Thabi thinks of Zodwa and Brenda, twin sisters who look exactly alike.\r\n\"What kind of twins could ours be?\" her mind wanders off.\r\n\r\nThe big day has come and Thabi is so excited. She has waited 3 days (or, 72 hours), but it feels like many months since her mother went to hospital.\r\nThey have waited 9 months for the baby to grow inside her mother's tummy. Thabi counts back in months, \"April to March is 1 month, to February is 2 months…\"\r\nCount back to find what month the baby first started growing inside Mom's tummy.\r\n\r\nThabi hears her parents at the front door. Thabi keeps very quiet. She wants to surprise them.\r\nBut Thabi is in for a much bigger surprise. Her mother has come home with twins! Thabi has a sister and a brother!",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/waiting_for_baby",
    "pdf_file": "2024/3/pdf/waiting_for_baby.pdf",
    "image_file": "12_06_2024-22_24_38~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "1"
  },
  {
    "id": "366",
    "postid": "366",
    "title": "Thimba to the rescue!",
    "description": "Thimba to the rescue!\r\nBy: Penelope Smith, Catherine Groenewald",
    "long_story": "Thimba to the rescue!\r\n\r\nGobani was a very tall man. The villagers called Gobani the Gentle Giant, because he was quiet and friendly. He was not like the bad giants you read about in some stories. During the day Gobani worked in his garden.\r\nHis hoe was very short and he had to bend right down to work with it. His back must have hurt from all the bending down.\r\n\r\nThimba lived next door to Gobani. It made him sad to see Gobani struggling with his short hoe, or bending down to get through his door.\r\nThimba decided to help Gobani. He spoke to the village elders and asked them for help. But before they could help, they needed to know exactly how tall Gobani was.\r\n\r\nThimba asked Gobani, \"How tall are you?\" Gobani estimated, \"I am about 2,5m tall.\" He lay down on the bed and explained, \"I know my mattress is 1,5m long. You can see that my legs hang over the end for at least another metre. So that means I must be at least 2,5m tall.\"\r\nThimba could now tell the elders that Gobani was 2,5m tall. That is very tall!\r\n\r\nThimba could now start working on his secret plan.\r\nThimba, Gobani and his pet chicken, Choke, set off for market on Gobani's tiny bike. Gobani had to lift his feet above the handle bars in between peddling. Thimba hid inside the basket, too frightened to watch the road as the bike swerved from side to side.\r\n\r\nAt the village square, Gobani got off his bicycle, and a swarm of friendly villagers surrounded him. The village chief welcomed him. \"Hello Gentle Giant,\" he said. \"Young Thimba told us that you face problems in your life, being so tall.\"\r\n\"We want to help you. We will make sure that everything you need is the right size for you. Soon your problems will disappear. Just wait and see.\"\r\n\r\nThe villagers worked around the clock to make sure everything Gobani needed was made the correct size.\r\nLook at his new hoe. Compare the length of the new hoe with his old one. The new one looks twice as long. How long do you think it is? More than one metre? Less than two metres?\r\n\r\nNext the villagers helped Gobani build a taller door frame with a new door for his house. It was a bit taller than Gobani, so he no longer had to stoop down to get inside. Just right! Look closely at the picture. Gobani is about 2,5 metres tall. How tall do you think his new door frame is?\r\n\r\nNext came a brand new bed and mattress with extra-long sheets and blankets to cover Gobani's long body from head to toe. At last he could look forward to hours of peaceful rest and sleep. His feet would no longer hang over the end of the mattress.\r\nLook how his whole body is now completely covered. There is even some space left over at the end.\r\n\r\nThe chief asked one of the village steel workers to make a giant-sized bicycle for Gobani. It had a basket that was big enough for both Thimba and Choke to sit in.\r\nThe saddle, the handle bars and the peddles were just the right height. Gobani did not have to drag his legs on the road or swing them over the handle bars to keep them out of the way.\r\n\r\nThe carpenters made Gobani a new table to sit at with legs that are at least 1,5m tall. Now when he sits down to eat, his feet touch the ground. Thimba sits next to him on a very tall stool. He needs a ladder to reach the top. Count how many rungs he has to climb to be level with Gobani. How tall do you think the ladder is?\r\n\r\nGobani's new hoe made it easy for him to plant and harvest. His garden became a forest! Gobani leaves baskets of fruit outside his front door for the villagers, to show how thankful he is for their help. And this all began with young Thimba's dream to make life easier for his friend, the Gentle Giant.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/thimba_to_the_rescue",
    "pdf_file": "2024/3/pdf/thimba_to_the_rescue.pdf",
    "image_file": "12_06_2024-22_21_49~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "2"
  },
  {
    "id": "365",
    "postid": "365",
    "title": "The Land of No Old People",
    "description": "The Land of No Old People\r\nBy: Cleofas Samo Laura Liberatore",
    "long_story": "The Land of No Old People\r\n\r\n\r\nOnce upon a time, it happened in a village that a gang of young people decided to kill all the old people.\r\nThey wanted to stop the old people doing magic.\r\n\r\nBut one of the youths ran off with his father and hid him in the desert.\r\n\r\nAfter he had done this, the gang began killing the old people.\r\n\r\nNot long after, a snake came into the village from the desert.\r\nThe snake entered into the stomach of a small child. It kept poking its head out of the child's mouth.\r\n\r\nThe parents of the child and all the other people tried everything to solve this problem.\r\n\r\nBut they saw that if they killed the snake it would also kill the child. Everyone kept trying different things.\r\n\r\nThen, the young man who had hidden his father went and told him everything that had happened.\r\nAnd the old man replied, \"That's the easiest thing in the world to take care of!\"\r\n\r\nThe old man said, \"Go find a toad and tie it up near the snake. The snake will come out of the child's stomach to catch the toad.\"\r\nThe young man did just what his father said. The snake came out and started to chase the toad.\r\n\r\nAnd the child was saved from death.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/the_land_of_no_old_people",
    "pdf_file": "2024/3/pdf/the_land_of_no_old_people.pdf",
    "image_file": "12_06_2024-22_19_19~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "364",
    "postid": "364",
    "title": "The lady in orange",
    "description": "The lady in orange\r\nBy: Ursula Nafula, Catherine Groenewald",
    "long_story": "The lady in orange\r\nBy: Ursula Nafula, Catherine Groenewald\r\n\r\n\r\nMy father took me to town in our old blue car.\r\nWe stopped at a big roundabout for the lights to turn green.\r\n\r\nI saw a lady walking on the side of the road.\r\nShe was wearing a beautiful bright orange dress.\r\n\r\nShe had a big red belt around her waist.\r\n\r\nIn her hand, she carried a shiny little orange purse.\r\n\r\nShe wore a pair of shiny orange high- heeled shoes.\r\n\r\nShe stopped and touched her long hair.\r\nIt was held together in the middle with a hairpin.\r\n\r\nAs she fixed her hairpin, her purse fell down.\r\n\"Ooh,\" I said feeling bad for her.\r\n\r\nThe lady bent to pick up her purse.\r\n\r\nShe cleaned the dust off her purse. I saw long orange earrings.\r\n\r\nThe lights changed green, and our car drove off. I kept looking behind.\r\n\r\n\"What are you looking at?\" my father asked.\r\n\r\n\"At the lady in orange,\" I said. I thought of the colour orange all day.",
    "category": "Story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/the_lady_in_orange",
    "pdf_file": "2024/3/pdf/the_lady_in_orange.pdf",
    "image_file": "12_06_2024-16_21_29~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "1"
  },
  {
    "id": "363",
    "postid": "363",
    "title": "The baboons that went this way and that",
    "description": "The baboons that went this way and that\r\nBy: Southern African, Folktale, Benjamin Mitchley",
    "long_story": "The baboons that went this way and that\r\n\r\nThe people in a village of small huts were becoming unhappy.\r\nWild animals began to come and frighten them.\r\n\r\nThese animals ate all their crops and even carried children away.\r\nIt was not a good place to live any longer, but where could the people go?\r\n\r\nOne family found the answer.\r\nIt was not hard to find food up in the hills.\r\n\r\nBushes grew in the cracks between rocks. Trees grew on the slopes of the hills.\r\nThe parents trapped rock rabbits and the children caught birds.\r\n\r\nOther families noticed how well the hill family lived.\r\n\"It is a good life up in the hills,\" said the husband. \"You should come there too.\"\r\n\r\nSoon the other families left the flat land and went up to the hills.\r\nEach family found a cave to live in, and felt warm and secure.\r\n\r\nSoon the children became very quick at climbing rocks, and finding fruit in the trees.\r\nThey could swing in the branches almost as well as any monkey.\r\n\r\nSlowly, things began to change. The children talked less, and grunted more.\r\nThen the adults noticed that their noses were getting bigger and that they were growing more hair.\r\n\r\nEvery time they looked at one another they saw that their teeth were longer. They started to walk on four legs.\r\n\r\nThey became a new creature that no-one had seen before in that place.\r\nThis was the creature which people now call the baboon.\r\n\r\nFor a time, the baboons lived happily. They stopped chasing the rock rabbits and ate grubs from the ground.\r\n\r\nThey forgot how to talk. They took off their clothes because their legs and arms were covered with dark hair.\r\n\r\nThey still remembered that they had been people. They looked at each other's big noses and laughed at each other.\r\n\r\nBut they did not like the laughing. They jumped up and down in anger.\r\nSoon the baboons could not be together because of the laughing and the anger.\r\nEach family went off and lived by itself.\r\n\r\nThat is why baboons live in small groups today and do not live as a baboon nation.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/the_baboons_that_went_this_way_and_that",
    "pdf_file": "2024/3/pdf/the_baboons_that_went_this_way_and_that.pdf",
    "image_file": "12_06_2024-16_19_17~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "362",
    "postid": "362",
    "title": "Proverbs of the Nyungwe People",
    "description": "Proverbs of the Nyungwe People\r\nBy: Little Zebra Books Max Okoto",
    "long_story": "Proverbs of the Nyungwe People\r\nBy: Little Zebra Books Max Okoto\r\n\r\n\r\nTo kill a baboon, you must have dry eyes.\r\n\r\nThe dog that barks, doesn't bite.\r\n\r\nWhen hippos fight, it's the grass that suffers.\r\n\r\nThe chick dirties the nest because that's what she sees her mother do.\r\n\r\nDon't say that there's an elephant there when you're up on my shoulders.\r\n\r\nA frog and a toad are both born the same way.\r\n\r\nA single fingernail cannot kill a flea.\r\n\r\nThe lion that doesn't have meat, eats grass.\r\n\r\nIt's the little goat in the back of the flock that gets the stick.\r\n\r\nYou're afraid of the dark when there are not even hyenas.\r\n\r\nThe chameleon dies of shame.\r\n\r\nTo see the eyes of a snail you must wait.\r\n\r\nLaugh at the turtle, but he's the one that has water.\r\n\r\nIt's the visitor that kills the snake.\r\n\r\nThe hyena that howls in the fields does not eat millet.\r\n\r\nThe human-eating lion does not go out at night.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/proverbs_of_the_nyungwe_people",
    "pdf_file": "2024/3/pdf/proverbs_of_the_nyungwe_people.pdf",
    "image_file": "12_06_2024-16_17_09~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "361",
    "postid": "361",
    "title": "Pig that wouldn't listen",
    "description": "Pig that wouldn't listen\r\nBy: Zanele Mguye, Marion Drew",
    "long_story": "Pig that wouldn't listen\r\nBy: Zanele Mguye, Marion Drew\r\n\r\n\r\nAfter a long day at the farm, it was time for all the animals to go to sleep.\r\nBut not everyone was willing to listen to the farmer.\r\n\r\n\"Time for bed Miss Piggy,\" said the farmer. \"In the pen you go.\"\r\n\"Oh no I won't, I won't go into the pen,\" said Miss Piggy.\r\n\r\n\"Trusty Whip, please whip Miss Piggy into the pen,\" said the farmer to her trusty whip.\r\n\"Oh no I won't, I won't whip Miss Piggy,\" said Trusty Whip.\r\n\r\n\"Fiery Fire, please burn Trusty Whip, he won't whip Miss Piggy into the pen,\" said the farmer to the fire.\r\n\"Oh no, I won't, I won't burn Trusty Whip,\" said Fiery Fire.\r\n\r\n\"Clear Water, please put out Fiery Fire, he won't burn the Trusty Whip, and Miss Piggy won't go into the pen,\" said the farmer to the water.\r\n\"Oh no I won't, I won't put out the fire,\" said Clear Water.\r\n\r\nThen along came Milky Moo, the cow. \"Milky Moo, please drink Clear Water, who won't put out Fiery Fire. Fiery Fire won't burn Trusty Whip, and Miss Piggy won't go into the pen,\" said the farmer.\r\n\r\n\"MOOO!\" said thirsty Milky Moo with excitement.\r\n\"Of course I will drink the water.\"\r\n\r\n\"No! No! No! Milky Moo, please don't drink me,\" cried Clear Water. \"I will put out Fiery Fire.\"\r\n\r\n\"Oh no you won't put me out!\" shouted Fiery Fire. \"I will burn Trusty Whip.\"\r\n\r\n\"Please don't burn me Fiery Fire,\" cried Trusty Whip. \"I will whip Miss Piggy into the pen.\"\r\n\r\nMiss Piggy was annoyed. \"There will be no need for you to whip me, Trusty Whip,\" she said. \"I will go into the pen.\"\r\n\r\nMiss Piggy went into her pen and was ready for bed.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/pig_that_wouldnt_listen",
    "pdf_file": "2024/3/pdf/pig_that_wouldnt_listen.pdf",
    "image_file": "12_06_2024-16_05_45~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "360",
    "postid": "360",
    "title": "Pa Nase the spider and the village women",
    "description": "Pa Nase the spider and the village women\r\nBy: Abdul Koroma Kenneth Boyowa, Okitikpi",
    "long_story": "Pa Nase the spider and the village women\r\nBy: Abdul Koroma Kenneth Boyowa, Okitikpi\r\n\r\n\r\nOnce upon a time, Pa Nase the spider felt very hungry. He decided to go in search of food.\r\nHe visited his friend's place where he usually got help. But his friend was not at home.\r\n\r\nHungry Pa Nase thought of an idea for getting food. He remembered the store where the village women usually kept food.\r\n\r\nHe sneaked into the store and stole some fish and bananas.\r\n\r\nOn his way out, the little children noticed his unusual movements. They called on one of the women.\r\nThe women rushed at Pa Nase.\r\n\r\nWith loaded pockets, Pa Nase was very afraid and wanted to run. The women caught him and decided to punish him.\r\n\r\n\"Let us grind him on the village stone,\" Yalol, one of the women suggested.\r\n\r\nPa Nase laughed out loud and said, \"My grandfather lives in this rock. Grinding me on it is like sending me home. Thank you!\" The women decided not to grind him.\r\n\r\n\"Let us throw him in the fire,\" said Yangbet. Again, Pa Nase laughed and said, \"My grandmother, who loved me so much, is the owner of all fires. Throwing me into fire is like sending me home. Thank you!\" The women felt disappointed.\r\n\r\n\"Let us fill a basket with fruit, put him inside and throw it into the river\" Yabana suggested. At this, Pa Nase cried, \"You have finally killed me!\" The women were happy. They filled a basket with fruit, put him inside and threw it into the river.\r\n\r\nOnce in the middle of the river, Pa Nase celebrated. He took some fruit and ate as he laughed at the women.\r\n\r\nThe women felt tricked and tried to hook Pa Nase. But the fast flowing river did not allow them to catch him.\r\n\r\nPa Nase forgot that there was fishing net down the river. He was caught in the net and got trapped. Nobody came to help him.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/pa_nase_the_spider_and_the_village_women",
    "pdf_file": "2024/3/pdf/pa_nase_the_spider_and_the_village_women.pdf",
    "image_file": "12_06_2024-16_00_07~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "359",
    "postid": "359",
    "title": "Old rooster",
    "description": "Old rooster\r\nBy: Cissy Kiwanuka Luyiga, Magriet Brink",
    "long_story": "Old rooster\r\nBy: Cissy Kiwanuka Luyiga, Magriet Brink\r\n\r\n\r\nOnce upon a time, there was an old woman who lived alone. She had many chickens. Among them was a rooster that was very old and could no longer crow.\r\n\r\nOne day the old woman's grandson visited. She was very happy to see him. She asked the young man to catch Old Rooster so they could cook and eat it.\r\n\r\nOld Rooster heard the woman talking and its heart sank. \"Aaiii, you are also very old but I don't see anyone trying to kill you, we will see!\"\r\nSo Old Rooster sneaked away and decided to head for the big city to start singing.\r\n\r\nOld Rooster met Cat. \"What has happened?\" Cat asked. \"My boss wants to eat me because I can no longer tell her the time,\" said Old Rooster. \"I am going to the city to sing. Where are you going?\"\r\n\"My boss also wants to kill me because I can no longer catch rats. I am running away,\" said Cat. \"Can I join you?\" \"Let's go!\" said Old Rooster.\r\n\r\nThey had walked a short while when they saw Dog running very fast. Old Rooster called Dog and asked why he was running so fast. \"My boss chased me because I can no longer catch thieves,\" replied Dog while panting. \"We have similar problems. We are going to the big city to sing,\" said Old Rooster. \"Can I join you?\" asked Dog.\r\n\r\nAs the three animals walked, Horse stopped them and asked what was happening. \"Our bosses want to kill us because we can no longer do our jobs,\" they all replied together. \"I have the same problem, where are you going?\" asked Horse. \"We are going to the big city to sing,\" they replied. Horse asked to join them and they accepted.\r\n\r\nThey all walked until it was dark. They saw a house and when they reached it they heard noises inside. They were afraid and decided to sing a song to chase the people who were in the house.\r\nHorse stood on the ground, Dog climbed onto Horse's back, Cat climbed on Dog's back, and Old Rooster climbed on Cat's back.\r\n\r\nThey immediately started singing. \"Kookoliookoo,\" sang Old Rooster. \"Myaaawuu myaaawuu,\" sang Cat. \"Woo woo,\" sang Dog. \"Wuuuu wuuuu,\" sang Horse.\r\nThey all sang loudly together. The people inside the house were thieves. The thieves were afraid and ran away.\r\n\r\nOld Rooster, Gog, Horse and Cat entered the house and found food. When they had finished eating they went to sleep.\r\nOld Rooster slept near the door, followed by Cat, Dog, and lastly Horse.\r\n\r\nIt was not too long before the thieves were back. Their boss was the first to go into the house.\r\nHe had just opened the door when Old Rooster pecked him with its beak. Then Cat scratched him with its nails. And then he found Dog, which bit him.\r\n\r\nThe man jumped but continued into the house. He found Horse, which kicked him to death.\r\nThe other thieves did not enter the house. They ran away, never to return.\r\n\r\nThe animals lived happily ever after in that house. Old Rooster told the time to his friends, and Dog kept them safe. Cat killed all the rats in the house, and Horse carried them on its back wherever they wanted to go.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/old_rooster",
    "pdf_file": "2024/3/pdf/old_rooster.pdf",
    "image_file": "12_06_2024-15_56_17~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "358",
    "postid": "358",
    "title": "Nema buys thread",
    "description": "Nema buys thread\r\nBy: Little Zebra Books, Mirjam Gyger",
    "long_story": "Nema buys thread\r\nBy: Little Zebra Books, Mirjam Gyger\r\n\r\nThis is Nema. Nema is sewing. Nema is sewing a skirt.\r\n\r\nNema is sewing with thread. The thread runs out. Nema needs to buy more thread.\r\nNema needs money to buy thread. Where will she get some money?\r\n\r\nNema sees a tree. The tree is nearby. The tree has fruit.\r\nThe fruits are papayas. Papayas are delicious.\r\n\r\nNema has a stick. She gets the papayas.\r\n\r\nNema arrives at the market.\r\nShe arrives at the market with the papayas. She wants to sell the papayas.\r\n\r\nLook at the man. The man buys a papaya. He gives money to Nema.\r\nNema sells lots of papayas. She is going to buy thread with the money.\r\n\r\nIn the market she sees bananas. She does not buy bananas.\r\n\r\nIn the market she sees tomatoes. She does not buy tomatoes.\r\n\r\nIn the market she sees a sieve. She does not buy the sieve.\r\n\r\nIn the market she sees bread. She does not buy bread.\r\n\r\nThen Nema sees a man. The man is selling thread. Nema buys thread.\r\n\r\nNema has thread! She is so happy. She will finish sewing her skirt with the thread.\r\n\r\nQuestions.\r\n- How many parts of the body are mentioned?\r\n- Name the body parts and their functions.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/nema_buys_thread",
    "pdf_file": "2024/3/pdf/nema_buys_thread.pdf",
    "image_file": "12_06_2024-15_45_22~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "1"
  },
  {
    "id": "357",
    "postid": "357",
    "title": "Ndalo and Pendo – The best of friends",
    "description": "Ndalo and Pendo – The best of friends\r\nBy: Penelope Smith, Rob Owen",
    "long_story": "Ndalo and Pendo – The best of friends\r\nBy: Penelope Smith, Rob Owen\r\n\r\n\r\nMeet Ndalo. He is 10 years old and in Grade 5 at the village school. Ndalo always comes top of his class. \"What's his secret?\" his schoolmates ask themselves.\r\n\"He's excellent in reading and writing. How does he do it?\" they wonder. Ndalo tells them it is because he reads lots of books. While they waste their time doing nothing, he spends all his free time reading.\r\n\r\nNdalo sometimes earns R80 a week in pocket money. He spends most of the pocket money on books at the second-hand bookshop in his village.\r\nSo how does Ndalo earn enough pocket money for these books? Read on to find out.\r\n\r\nMeet Pendo, the family's milking cow. She produces over 20 litres of milk per day. Ndalo's father sells the milk.\r\nA cow needs food and water, and time to graze in the veld. So each day after school Ndalo helps with this work. Ndalo's father gives him pocket money for the work he does. And it is this money that Ndalo saves to buy books each week.\r\n\r\nFirst, Ndalo gives Pendo a bunch of carrots. He gives her exactly eight carrots a day. Each day he picks the carrots from his father's vegetable patch, enough for a day at a time.\r\nYou can work it out. You will find that Pendo eats nearly 60 carrots a week. Can you tell exactly how many?\r\n\r\nAfter that, Ndalo takes Pendo to graze in the fields. His father warned him to watch the time and not give Pendo more than three quarters of an hour to graze.\r\nPendo usually starts grazing at about quarter past two, so that Ndalo can take her back to the milking shed at 3 o'clock. In winter when it gets dark earlier, Ndalo may start grazing earlier, around half past one.\r\n\r\nNext Ndalo gives Pendo water. Without water Pendo won't produce milk, no matter how much Ndalo feeds her. Ndalo fetches buckets of water from the village pump because there isn't one nearby.\r\nPendo's trough holds about 30 litres of water. Ndalo's bucket only holds 5 litres. So to fill the trough Ndalo has to make many trips. Can you work out how many trips he has to make?\r\n\r\nThen, Ndalo takes Pendo to his father to get her daily 12 kg bag of grain. Ndalo calculates that's almost 90 kg a week.\r\nEach bag costs R39. Ndalo works out the cost of grain for each week. First he works out the cost of 7 bags at R40, which makes R280. Then he subtracts R7 to get R273. \"That's over R1 000 a month!\" Ndalo estimates. Is he correct?\r\n\r\nNdalo's father milks Pendo twice a day. She produces about 24 litres of milk a day, so about 12 litres for each milking.\r\nSometimes Ndalo helps with the milking but it is not as easy as it looks. \"One day,\" he thinks to himself, \"I will have my own cows and I will have to do all the milking myself.\"\r\n\r\nHis father pours the milk from the big bucket into smaller two litre cans or one litre bottles. He then sells the milk for R8 a litre.\r\nOnce a week Ndalo's father donates 25 litres of milk to the school feeding scheme. Each child gets a quarter litre of this milk. That means that 100 children get milk on this day.\r\n\r\nFor each litre of milk sold, his father gives Ndalo 50c. That doesn't sound like a lot, but if his father sells 24 litres a day, it adds up to quite a bit. Can you tell how much? Ndalo saves his money until Saturday when he makes a trip to the book shop. Each book costs less than R10, so in a good week, he can buy quite a few.\r\n\r\nNdalo also loves to drink Pendo's milk. His father says that milk helps to build strong bones and teeth and makes a person fit and healthy. So by drinking milk and eating lots of vegetables from his father's garden, Ndalo is strong and healthy. He seldom gets sick and never goes hungry.\r\n\r\nNdalo never forgets to thank Pendo at the end of each day. He rewards her with extra carrots or spinach leaves that he finds lying around the garden.\r\n\"Thank you Pendo, you are my best friend! It is thanks to you that I am strong, healthy and clever. If not for you I would never be able to buy all the books that help me be top of my class.\"",
    "category": "Story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/ndalo_and_pendo_the_best_of_friends",
    "pdf_file": "2024/3/pdf/ndalo_and_pendo_the_best_of_friends.pdf",
    "image_file": "12_06_2024-15_42_08~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "356",
    "postid": "356",
    "title": "Nangila's courage",
    "description": "Nangila's courage\r\nBy: Violet Otieno, Vusi Malindi",
    "long_story": "Nangila's courage\r\nBy: Violet Otieno, Vusi Malindi\r\n\r\n\r\nLong ago, there was a man who had a very serious wound on his leg. He could not stand or walk.\r\nThis man lived in a village with his wife and their children.\r\n\r\nThe couple had three sons and one daughter. The daughter's name was Nangila. Her duty was to take care of her father.\r\nThe sons worked on the land and grazed animals.\r\n\r\nNangila was a beautiful girl. All the villagers liked and respected her.\r\nHer parents wanted a good husband for Nangila. They set a difficult task in order to find the right man.\r\n\r\nAnyone who wanted to marry Nangila would have to get a herb from a lake near the village.\r\nThis herb would heal her father's wound. But the lake was filled with dangerous spirits.\r\n\r\nSome men tried to get the herb but returned without it.\r\nSome men did not return from the lake at all.\r\n\r\nNangila felt worried. Not even her brothers would go to the lake. One day, she decided to fetch the herb herself.\r\nHer mother said, \"My daughter, if strong men have failed, how will you succeed?\"\r\nBut Nangila had made up her mind.\r\n\r\nOn the way to the lake, Nangila met an old woman carrying wood. She helped the woman to carry her firewood.\r\nThe old woman was grateful. She said to Nangila, \"I will tell you how to reach the spirit lake and what to do when you get there.\"\r\n\r\nWhen she reached the shore of the lake, Nangila saw the spirit family drinking and dancing.\r\nShe waited and watched. One by one, the spirits fell asleep.\r\n\r\nOnce the spirits were all sleeping, Nangila dived into the lake.\r\nShe found the herb and put it in her bag. As she swam back to land, the waves were rising.\r\n\r\nWhen Nangila reached the shore the spirits were awake. She sang the song the old woman taught her: I, daughter of Wekesa, am from the lake. I came because men are too scared to come. My father needs this herb to heal his wound. That is why I am here where many are scared to reach, for you are the rulers.\r\n\r\nNangila's voice was so sweet that the spirits asked her to sing for them again and again. Her singing sent the spirits back to sleep.\r\nThen Nangila ran very fast until she got to her village.\r\n\r\nEveryone was waiting for Nangila to return. After treating his wound with the herb her father was able to stand again. The entire village danced and praised Nangila.\r\n\r\nQuestions.\r\n- How many parts of the body are mentioned?\r\n- Name the body parts and their functions.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/nangilas_courage",
    "pdf_file": "2024/3/pdf/nangila_s_courage.pdf",
    "image_file": "12_06_2024-15_35_05~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "355",
    "postid": "355",
    "title": "Mr Motaung's thirds",
    "description": "Mr Motaung's thirds\r\nBy: African Storybook, Marleen Visser",
    "long_story": "Mr Motaung's thirds\r\nBy: African Storybook, Marleen Visser\r\n\r\n\r\nIt is break time at Siyafunda Primary School. Nomsa, Jabu and Zodwa have just sat down in the shade to enjoy their lunch.\r\nToday Nomsa and Zodwa brought food from home, but Jabu is eating a kota from Mr Mkhize's shop.\r\n\r\n\"Mmmm, this cheese is creamy! Mr Mkhize's kotas are the best!\" exclaims Jabu licking his fingers. Tebogo is sitting nearby and overhears Jabu. He can't believe his ears.\r\nTebogo asks, \"Did you just say there's cheese on Mkhize's kota? Did you say Mkhize's kotas are the best? Are you joking?\"\r\n\r\n\"Haa! You don't know Mr Mkhize! He's changed his ways and this kota speaks for itself,\" says Jabu pointing at his kota. The kota is stuffed with chips, polony and atchar, and covered in creamy melting cheese.\r\nTebogo is impressed. Just then Scelo arrives with his lunch and Tebogo says to his friend, \"Hey Scelo, look at this kota!\"\r\n\r\nJabu notices Scelo's face and asks, \"Why are you so serious?\" Scelo puts his kota on the bench next to Jabu's kota.\r\n\"I got my kota from Mr Motaung. The kotas are equal in size, but mine has less filling!\"\r\n\"Yes,\" says Nomsa, \"that's exactly why so many kids are buying from Mr Mkhize's shop now.\"\r\n\r\n\"So Mr Mkhize is a changed man? He used to slice one loaf of bread into five parts to make his kotas!\" says Tebogo.\r\n\"Ah!\" replies Nomsa, \"that was not a kota at all!\"\r\n\"Why was it not a kota?\" asks Scelo.\r\n\r\n\"Ha Scelo!\" laughs Nomsa. \"Don't you remember what our teacher taught us about fractions? Cutting one loaf of bread into five equal pieces does not give us quarters. It gives us fifths.\"\r\nScelo thinks, then he says, \"I remember! Each part of a whole divided into 5 equal parts is ⅕ of the whole. Each part of a whole divided into 4 equal pieces is ¼ of the whole.\"\r\n\r\nZodwa interrupts, \"But hey guys, what is going on with Mr Motaung's kota's? They're a quarter of a loaf, but they contain less than Mr Mkhize's kotas.\"\r\nJabu frowns and says to the group, \"If Motaung is having problems and goes out of business, then Mkhize will have no competition. What if Mkhize gets greedy and goes back to his bad old ways?\"\r\n\r\nA few days later, Mr Motaung is getting ready to sell lunch at break time. He's worried. Lately, fewer and fewer learners are buying from him.\r\nMr Motaung asks himself, \"Why are they all flocking to Mkhize? I thought we were selling the same kota at the same price.\"\r\n\r\nJabu on his way from Mr Mkhize's shop passes by Mr Motaung's shop. He calls the boy over, \"Hey Jabu, how are you?\" Mr Motaung's eyes are not on Jabu but on the kota Jabu is carrying!\r\nHe smiles when he realises that the kota has got more chips, more cheese, more polony and more atchar than his kotas!\r\n\r\nThe next time Nomsa and Zodwa are buying kotas, Mkhize gives them a gift. \"Wait a minute, I've got a surprise for you. Soon I'll be selling fruit at my shop. Here are some sweet juicy apples to try for free. Please share with your friends.\"\r\n\r\nThe girls are delighted. \"Thank you Mr Mkhize!\" they say at the same time. They decide to share the apples with Jabu, Tebogo and Scelo. They go to find them in the yard.\r\n\r\nZodwa tells the boys, \"Mr Mkhize gave us these apples to share. He wants to sell them at his shop.\" Nomsa puts the apples on the bench so that they can all count them.\r\n\"Well,\" says Tebogo, \"we can each have an equal number of apples. But there's one apple left over.\"\r\n\r\n\"Let's cut that remaining apple into three equal parts,\" suggests Jabu. \"What are three equal parts called?\" mutters Nomsa to herself.\r\n\"Thirds! Cut the apple into thirds!\" says Scelo proudly\r\n\r\n\"No, let's give that leftover apple to our maths teacher!\" says Zodwa.\r\nThe friends agree that it's a good suggestion to give the apple to Ms Nkosi after break.\r\n\r\nThe next week, Jabu and Nomsa are waiting for Zodwa at break. \"Look, Motaung is back in business!\" she says. Zodwa puts her kota on the bench and the three of them compare their kotas.\r\n\"Wow!\" says Jabu, \"that kota is bigger than a quarter! And look at all those chips!\"\r\n\"I bet this cost a lot extra?\" asks Nomsa suspiciously.\r\n\r\nAfter break, as they head back to class, Zodwa takes her friends to read the notice board outside Mr Motaung's shop. Jabu and Nomsa can't believe their eyes when they read the sign: Get your supersize kota third! Only R3 more! A third of a loaf with extra chips and extra sauce. With polony OR cheese!\r\n\r\n\r\nQuestions.\r\n- How many parts of the body are mentioned?\r\n- Name the body parts and their functions.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/mr_motaungs_thirds",
    "pdf_file": "2024/3/pdf/mr_motaung_s_thirds.pdf",
    "image_file": "12_06_2024-15_32_44~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "354",
    "postid": "354",
    "title": "Mr Mkhize's quarters",
    "description": "Mr Mkhize's quarters\r\nBy: Lorato Trok, Marleen Visser",
    "long_story": "Mr Mkhize's quarters\r\nBy: Lorato Trok, Marleen Visser\r\n\r\n\r\nIt is nearly break time at Siyafunda Primary School.\r\nThe two spaza shop owners at the school are preparing lunch to sell to hungry children.\r\n\r\nn Mr Motaung's shop, the bread is cut and ready for making kotas. He carefully cuts out the soft middle of each quarter loaf. Then he puts polony and chips in the space inside.\r\nMotaung puts two spoonfuls of his wife's homemade atchar in each kota. He likes to boast that his kotas have atchar inside and atchar on top!\r\n\r\nIn Mr Mkhize's shop, the chips are nearly ready, but he is still cutting his bread for kotas. He is worried. Things are not going well with his shop.\r\n\"It started well,\" thinks Mkhize. \"But now I get fewer and fewer customers. At least I'm reducing some of my costs by cutting five kotas from a loaf.\"\r\n\r\nJabu and Zodwa are buying lunch. Zodwa buys from Mr Mkhize. Jabu buys from Mr Motaung.\r\nHe believes that Motaung's kota has got more chips and atchar than Mkhize's kota.\r\n\r\nThe queue at Mr Motaung's shop is always longer.\r\nZodwa waits for Jabu. Then the friends sit together in the shade to enjoy their kotas.\r\n\r\nZodwa notices something that makes her stare and frown. \"What are you staring at?\" asks Jabu.\r\n\"Your kota! It looks bigger than mine,\" says Zodwa.\r\n\r\nThey both look very closely at their kotas. Sure enough, Jabu's is bigger. \"Something is not right here,\" says Zodwa. \"I wonder if this is the reason Mr Mkhize's shop is not busy anymore.\"\r\nJabu thinks for a while and then he says, \"Well, I heard that some kids saw Mkhize cutting his bread into five pieces for kotas!\"\r\n\r\nNomsa overhears Jabu and Zodwa talking. She curiously asks them what's wrong with cutting it into five pieces for kotas. Zodwa and Jabu reply together, \"A kota is a quarter of a loaf!\"\r\nNomsa still looks confused, so Zodwa explains, \"The loaf must be cut into four equal pieces. Otherwise, they are not quarters.\"\r\n\r\nNomsa is cross because she also buys from Mr Mkhize. \"So, he is stealing bread from us!\" she says in a loud voice.\r\nZodwa decides to go back to Mkhize's shop to complain. She marches off, holding her kota up in the air.\r\nNomsa hurries behind her. Jabu sighs and gets up to follow his friends.\r\n\r\nMr Mkhize is disappointed when he sees that the children aren't new customers. \"Oh, hello again kids,\" he mutters, \"how can I help you?\" \"Mr Mkhize, I asked you for a quarter and I paid you for a quarter. But this is not a quarter,\" says Zodwa, pointing at her kota. \"I want a quarter kota or my money back,\" she adds firmly.\r\n\r\n\"Is it true Mr Mkhize? You've been cheating us!\" cries Nomsa. A few children have followed them to the shop and are now listening to the fierce accusations.\r\nMkhize waves his hands wildly. \"What are you saying about me?\" he protests. \"I'm not like that! I want you to get out of my shop now!\"\r\n\r\nThen Zodwa says quietly, \"We will tell everyone what you are doing. It will spread like wildfire throughout the school. You will have to close your shop. No one will come and buy from you!\"\r\nMr Mkhize looks at the three children standing in front of him. Then he looks at the growing crowd outside his shop.\r\n\r\n\"OK,\" he says eventually, \"I will give you your money back. \"And also promise that you will cut each loaf into quarters for your kotas,\" speaks up Jabu.\r\nMr Mkhize promises that he will. Then he clears his throat and says loud enough for everyone to hear, \"I also promise that I will add more atchar and more chips to my kotas.\"\r\n\r\nMr Mkhize did indeed add extra chips and atchar to his kotas.\r\nSoon more children were buying from him, and his shop started doing well. He was even able to hire someone to help him.\r\n\r\nNow there is a healthy competition between Mr Mkhize and Mr Motaung, and everyone is happy.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/mr_mkhizes_quarters",
    "pdf_file": "2024/3/pdf/mr_mkhize_s_quarters.pdf",
    "image_file": "12_06_2024-15_28_48~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "353",
    "postid": "353",
    "title": "Monkey and the Drought",
    "description": "Monkey and the Drought\r\nBy: Alice Edui, Salim Kasamba",
    "long_story": "Monkey and the Drought\r\nBy: Alice Edui, Salim Kasamba\r\n\r\nThere was severe drought across the land. Bushes and trees dried up. Rivers stopped flowing.\r\nThere was no water and no food. People, cattle and wild animals grew thin.\r\n\r\nMany of the monkeys who lived in the hills died of hunger.\r\nOne day, a female monkey decided to look for a place where there was no drought.\r\n\r\nMonkey travelled for many days.\r\nShe passed bushes, climbed hills, and crossed valleys.\r\n\r\nFinally, Monkey arrived at a place called Tirkol.\r\n\r\nAt Tirkol, Monkey found different kinds of fruit and a flowing river.\r\nShe was very happy.\r\n\r\nMonkey stayed there. She ate plenty of fruit. She grew fat and shiny.\r\nShe swam in the river every day.\r\n\r\nAfter some time, Monkey decided to return to the hills. She wanted to see who had survived the drought.\r\nShe took fruit and followed the path she had used before.\r\n\r\nWhen she reached the hills, the surviving monkeys came to welcome her.\r\n\r\nEveryone wanted the fruit she brought.\r\nThey asked her, \"Where is this wonderful place? We want to go there too.\"\r\n\r\nMonkey told them about the goodness of Tirkol and agreed to take them there.\r\n\r\nAll the monkeys moved to Tirkol. They ate fruit, drank water, rested and grew fat.\r\nThey swore never to return to the hills.\r\n\r\nThe monkeys who lived in Tirkol soon discovered that monkeys from the hills had moved to their territory.\r\n\r\nThe Tirkol monkeys worried that the fruit would disappear.\r\nSo they decided to chase away the monkeys from the hills.\r\n\r\nOne day, the monkeys from the hills were at the river drinking water. The Tirkol monkeys attacked them with canes. They wanted to chase them away.\r\n\r\nBut just before they started fighting, an elderly monkey hung down from a branch.\r\nHe asked the monkeys, \"Why do you want to fight? There is enough food for all of us.\"\r\n\r\nAll the monkeys realised that this was true.\r\nAnd so, since that day, monkeys from the hills and monkeys from Tirkol have lived together without fighting.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/monkey_and_the_drought",
    "pdf_file": "2024/3/pdf/monkey_and_the_drought.pdf",
    "image_file": "12_06_2024-15_26_44~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "352",
    "postid": "352",
    "title": "Maria's Family",
    "description": "Maria's Family\r\nBy: Little Zebra Books Leo Daly",
    "long_story": "Maria's Family\r\nBy: Little Zebra Books Leo Daly\r\n\r\nI'm Maria.\r\n\r\nThis is my mother.\r\n\r\nThis is the baby.\r\n\r\nThis is my father.\r\n\r\nThis is my brother.\r\n\r\nThis is my sister.\r\n\r\nThis is my grandmother.\r\n\r\nThis is my grandfather.\r\n\r\nThis is my uncle.\r\n\r\nThis is my aunt.\r\n\r\nThis is my family.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/marias_family",
    "pdf_file": "2024/3/pdf/maria_s_family.pdf",
    "image_file": "12_06_2024-15_24_15~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "351",
    "postid": "351",
    "title": "Making new forests",
    "description": "Making new forests\r\nBy: Terkule Aorabee, Maya Marshak",
    "long_story": "Making new forests\r\nBy: Terkule Aorabee, Maya Marshak\r\n\r\n\r\nMumuye people love trees but they cut them down for firewood. Tiv people love animals but they burn bushes to kill rats. Mambilla, Kuteb, Jenjo, and all communities in Taraba farm. Forests disappear.\r\n\r\nEvery child must learn to break the soil and plant a tree every year. As they grow and water the trees to grow along with them.\r\n\r\nGirls and boys in the schools must learn to plant trees around the school premises. If every child plants a tree and waters it for the years they stay in school, we will build many new forests.\r\n\r\nParents at home and teachers at school must teach children to love and protect trees. Our lives depend on the lives of living trees.\r\n\r\nEvery teacher must teach children to read about how trees help us live longer. Trees protect our environments from strong winds. They keep away deserts and help the soil to produce more food, trees provide shelter from the harsh sun.\r\n\r\nAs the children grow and go to the university, they will understand even more that we need many trees around us to live well. The air we breathe in comes from trees and the one we breathe out is used by trees.\r\n\r\nThe more they learn, they will realize that we are in danger if we keep cutting down trees. Erosion will continue to wash away land. The sun will continue to give more heat. Winds will continue to take down houses.\r\n\r\nThey will grow up to see no trees and no animals. Even the wood to cook food will be bought from distant land. Village women will suffer to make fire and cook food. Children will be very hungry.\r\n\r\nWhen we teach the children how to plant trees, they will teach their children how to plant more. The women and men in our villages will grow more trees, more food and more money. Families will be happier.\r\n\r\nAs time goes on, rivers will flow and the Lake Chad will be full. Fishermen will catch more fishes. Herdsmen will find grass and water. Farmers will water their plants. Nigeria will know peace again.\r\n\r\nEvery Mother will wear a beautiful smile and and colourful dresses. Nigeria will be a happy and healthy place to live in. Beautiful People; Beautiful environment.\r\n\r\nBig trees grow from tiny seeds. A small tree today will be a big tree tomorrow. Small children will be big people tomorrow.Small children must plant and water small trees today.\r\n\r\nQuestions.\r\n- How many parts of the body are mentioned?\r\n- Name the body parts and their functions.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/making_new_forests",
    "pdf_file": "2024/3/pdf/making_new_forests.pdf",
    "image_file": "12_06_2024-15_21_38~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "350",
    "postid": "350",
    "title": "Magic baby",
    "description": "Magic baby\r\nBy: Simon Ipoo, Wiehan de Jager",
    "long_story": "Magic baby\r\nBy: Simon Ipoo, Wiehan de Jager\r\n\r\n\r\nThere once lived a man with a lot of livestock. He kept goats, camels, cows and donkeys.\r\nThe man was married to a beautiful woman.\r\n\r\nFor a long time, the man and his wife did not have a baby. Then the woman gave birth to a beautiful girl.\r\nThey named the baby Muurui. The man was happy and proud.\r\n\r\nThe woman was very busy. She left her baby alone in the hut and went to milk cows.\r\nThe baby's gourd of milk was also in the hut.\r\n\r\nWhen the baby was alone in the hut, she would wake up.\r\nShe would drink all of the milk, and begin to cry. Her mother would run home to nurse her.\r\n\r\nThe woman always found the gourd empty.\r\nThis was surprising! Who drank the milk?\r\n\r\nThe woman shared this problem with her husband.\r\nHe decided to find out what happened to the milk.\r\n\r\nThe man hid in the hut when his wife went out.\r\nTo his surprise, the baby got up and drank the milk! It was unbelievable.\r\n\r\nThe man told his wife what he saw and they decided to leave.\r\nThey went at night, when the baby was asleep. They left their home.\r\n\r\nAnd so, the magic baby was abandoned by her parents. They left her a goat, a cow and a camel.\r\nWhen Muurui awoke, she found the compound was quiet. She was all alone.\r\n\r\nShe felt angry. She killed the goat and the camel.\r\nThen she decided to hide inside the cow's stomach.\r\n\r\nWhile Muurui's cow was grazing, a man passed by and saw it.\r\nHe said, \"I will slaughter this cow for beef.\" He speared the cow.\r\n\r\nAs this man was skinning the cow, he heard a voice say, \"Do not harm me, I am in the cow's stomach!\"\r\n\r\nMuurui then grabbed the man's head.\r\nHe got such a fright that he ran away. He left the cow.\r\n\r\nWhen the man got home, he slaughtered a fat ram. He cooked the meat and took it to the magic baby.\r\n\r\nMuurui ate and was happy. The magic baby disappeared into the night.\r\n\r\nQuestions.\r\n- Which animals did the man keep?\r\n- What was the name of the baby\r\n- Where was the baby’s milk kept\r\n- Why did the man and his life abandon their baby\r\n- Why did the baby kill the goat and the camel?",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/magic_baby",
    "pdf_file": "2024/3/pdf/magic_baby.pdf",
    "image_file": "12_06_2024-15_19_39~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "349",
    "postid": "349",
    "title": "Lynne's birthday surprise",
    "description": "Lynne's birthday surprise\r\nBy: Leo Daly, Marleen Visser",
    "long_story": "Lynne's birthday surprise\r\nBy: Leo Daly, Marleen Visser\r\n\r\nLynne, Oupa Karel and Anton were getting things ready for Lynne's birthday party.\r\n\r\nAnton and Lynne are going to bake a cake. Oupa Karel reads the recipe.\r\n\r\n\"Let's mix these ingredients in the big bowl,\" said Lynne.\r\n\r\nAnton stirred the ingredients and made a big mess.\r\n\r\n\"The cake feels heavy now,\" said Oupa Karel.\r\n\r\n\"Your friends have arrived,\" said Oupa Karel.\r\n\r\nAnton thought the first present would be heavy because it was big.\r\n\r\nIt was a pillow and it weighed very little.\r\n\r\nAnton thought the next present would be light because it was small.\r\n\r\nIt was a painted rock and it weighed a lot.\r\n\r\nThe children said that 1 kilogram of rocks weighs the same as 1 kilogram of feathers.\r\n\r\nLynne's cake was burnt.\r\n\r\nLynne was very sad.\r\n\r\nAuntie Mavis asked Anton to guess how much her present weighed.\r\n\r\n\"It weighs the same as the cake that burned,\" said Anton.\r\n\r\nEveryone said, \"happy birthday, Lynne.\"",
    "category": "stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/lynnes_birthday_surprise",
    "pdf_file": "2024/3/pdf/lynne_s_birthday_surprise.pdf",
    "image_file": "12_06_2024-14_12_37~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "348",
    "postid": "348",
    "title": "Luwo's House",
    "description": "Luwo's House\r\nBy: Little Zebra Books, Jacob Matthess",
    "long_story": "Luwo's House\r\nBy: Little Zebra Books, Jacob Matthess\r\n\r\nLuwo went to church with his mother.\r\nShe was holding his hand on the path.\r\n\r\nInside the church there were many people gathered.\r\nThey were singing.\r\n\r\nLuwo left the church. His mother didn't see him.\r\n\r\nLuwo stood in the path.\r\nHe looked down the path, and thought, \"Where is my house?\"\r\n\r\nSo, he followed the path. He saw a big house.\r\n\"No, that's not our house. Our house is small.\"\r\n\r\nLuwo walked a bit more. He saw a house on stilts.\r\n\"No, that's not our house. Our house is not on stilts.\"\r\n\r\nHe kept on walking. He saw a small house of straw.\r\n\"No, that's not our house. Our house has mud walls.\"\r\n\r\nLuwo went farther. He saw a small house with a tree outside.\r\n\"No, that's not our house. Our house has two trees outside.\"\r\n\r\nAt last Luwo saw his mother coming toward him. Luwo ran to her.\r\nHis mother said, \"Let's go home!\"\r\n\r\nWhich house is Luwo's house?",
    "category": "Story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/luwos_house",
    "pdf_file": "2024/3/pdf/luwo_s_house.pdf",
    "image_file": "12_06_2024-14_04_17~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "347",
    "postid": "347",
    "title": "Look at the animals",
    "description": "Look at the animals\r\nBy: Jenny Katz, Sandy Campbell",
    "long_story": "Look at the animals\r\nBy: Jenny Katz, Sandy Campbell\r\n\r\nLook at the animals.\r\n\r\nThe cow says, \"Moo.\"\r\n\r\nThe goat says, \"Meh, meh.\"\r\n\r\nThe horse says, \"Neigh.\"\r\n\r\nThe pig says, \"Grunt.\"\r\n\r\nThe chicken says, \"Cluck.\"\r\n\r\nThe dog says, \"Woof.\"\r\n\r\nThe farmer says, \"Shhh!\"",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/look_at_the_animals",
    "pdf_file": "2024/3/pdf/look_at_the_animals.pdf",
    "image_file": "12_06_2024-13_59_12~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "346",
    "postid": "346",
    "title": "Little Jojo's long tall tale",
    "description": "Little Jojo's long tall tale\r\nBy: Leo Daly, Marleen Visser",
    "long_story": "Little Jojo's long tall tale\r\nBy: Leo Daly, Marleen Visser\r\n\r\n\"I have a very big problem,\" cried Chief Short and Round in a loud voice. \"Everyone, come here! I have a very big problem.\"\r\nThe people of the Village of Many Shapes formed a big circle around Chief Short and Round. They wanted to hear what he had to say.\r\n\r\nChief Short and Round began, \"This is the worst news ever. I have lost my spring horn.\" The villagers whispered to each other, \"Oh no!\" Chief Short and Round continued talking, \"If I don't find my spring horn then I can't blow my spring horn! And we can't start the springtime party if I can't blow my spring horn. And spring won't come if we don't have a springtime party.\"\r\n\r\nLittle Square Jojo stepped into the circle and lifted up his hand. \"I will find your spring horn, Chief Short and Round.\" \"Good, good,\" said the chief with a smile. \"You can start looking at the last place I visited this morning. Go to Tata Rectangle's house. I remember having my horn with me there.\"\r\n\r\nTata Rectangle was happy to see Jojo. He opened his door and welcomed Jojo inside. \"I remember seeing Chief Short and Round earlier this morning,\" said Tata Rectangle, \"but I don't think he had his spring horn with him.\" Little Square Jojo looked under Tata Rectangle's bed and behind his books. He even looked into his fridge. But Jojo couldn't find the spring horn anywhere.\r\n\r\n\"Go and see if Mama Triangle has the spring horn,\" said Tata Rectangle. \"Chief Short and Round visited her before he came to see me.\" \"Thank you, Tata,\" said Jojo as he waved goodbye. Mama Triangle's house is about three kilometres from here, thought Jojo. That is a far distance to walk. I will stop at my house along the way and have a rest.\r\n\r\nLittle Square Jojo was hot and tired by the time he reached his house. He went inside to open his freezer and pour a glass of cold water with ice blocks. \"I must be half the way to Mama Triangle's house,\" he said. \"I hope she has the chief's horn.\" Then Jojo had an idea. \"I can visit Dudu Diamond. Her house is only half a kilometre from here and it's on the way.\"\r\n\r\nDudu Diamond was cleaning her house when Jojo arrived. Her earrings were making a lovely tinkling sound as she worked. \"Hello, Jojo,\" she said. \"What are you doing today?\" \"I am on my way to Mama Triangle's house to find the chief's spring horn,\" said Little Square Jojo. \"That's nice of you,\" said Dudu. \"I am happy to come with you. How much further do you have to go?\"\r\n\r\nLittle Square Jojo scratched his head. \"Let's see. Mama Triangle's house was three kilometres away from where I started. I walked about half the way to get to my house, that's one and a half kilometres. Then I walked another half a kilometre to get to your house. That makes 2 kilometres. So we only have one more kilometre to go!\" \"That's not so far then!\" smiled Dudu. \"I'll pack some things to take with.\"\r\n\r\nDudu Diamond and Little Square Jojo walked until they reached the bottom of a tall mountain. \"Mama Triangle's house is right up there at the top,\" said Dudu. \"Let's stop for a while and have a rest. You can have the sandwich I packed.\" Jojo cut the sandwich into four smaller pieces. \"Here, let's share the sandwich, you have two pieces and I'll have two.\"\r\n\r\nSoon Dudu Diamond and Little Square Jojo were half the way up the mountain. Things were very different there. \"Look,\" said Jojo. \"That's the strangest spider I've ever seen.\" \"Wow,\" said Dudu. \"It has spun a beautiful web. Let's count the sides. One, two, three, four, five and six! That makes it a hexagon then!\"\r\n\r\nAfter climbing over a very big rock, Little Square Jojo and Dudu Diamond finally arrived at Mama Triangle's house. They were high up now and felt a bit dizzy. \"Hello, you two,\" said Mama Triangle with a smile. \"I am so happy to have visitors. Most of the time I'm all alone here on the top of my mountain. Come inside and sit down at my table.\"\r\n\r\n\"Mama Triangle,\" said Jojo after catching his breath, \"We've come to find Chief Short and Round's spring horn. Tata Rectangle said that the chief visited you this morning.\" \"Yes, that is correct,\" said Mama Triangle. \"The chief came to ask me to help prepare for the springtime party. But he didn't leave his spring horn here.\" \"Oh no,\" said Jojo sadly. \"We've come all this way for nothing!\"\r\n\r\nMama Triangle held Jojo's hand as she led him outside. \"Don't worry Jojo,\" she said. \"Chief Short and Round didn't leave his spring horn here but I know where it is. That chief can be such a silly thing!\" Mama Triangle, Little Square Jojo and Dudu Diamond all ran down the mountain and in no time at all they were safely at the bottom.\r\n\r\nIt was evening by the time they reached Chief Short and Round's house. Mama Triangle knocked on the door and when it was opened everyone rushed inside. \"Hello,\" said Chief Short and Round, blinking sleepily. \"Did you find my spring horn? Will we be able to have the springtime party?\" Little Square Jojo felt very bad and shook his head.\r\n\r\n\"Jojo looked for your spring horn all day,\" said Mama Triangle. \"It is not his fault that he didn't find it. It is your fault, Chief Short and Round. Don't you remember?\" Mama Triangle pointed at the chief. \"You are wearing your spring horn on your head!\" Chief Short and Round gasped, \"Oh my, I remember it now. I was so hot from climbing up that mountain that I put my horn on my head.\"\r\n\r\n\"I am so embarrassed,\" said Chief Short and Round as he took his spring horn off his head. Then he passed it to Little Square Jojo. \"You have done all the hard work, Jojo. You should blow the horn.\" Little Square Jojo smiled. He lifted up the horn and gave it a loud blow. \"Now we can have the springtime party!\" All was well in the Village of Many Shapes.\r\n\r\nQuestions.\r\n- How many parts of the body are mentioned?\r\n- Name the body parts and their functions.",
    "category": "Story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/little_jojos_long_tall_tale",
    "pdf_file": "2024/3/pdf/little_jojo_s_long_tall_tale.pdf",
    "image_file": "12_06_2024-13_57_13~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "345",
    "postid": "345",
    "title": "Lion gets sick",
    "description": "Lion gets sick\r\nBy: Little Zebra Books, Claudio Molina",
    "long_story": "Lion gets sick\r\n\r\nOne day, all the wild animals got together to choose a king.\r\nThey saw that it would be good to choose Lion to be the king of the animals.\r\n\r\nAt that meeting, they crowned Lion the king of the animals. As part of the ceremony, they had a big party that lasted a week.\r\nAll of the animals attended the ceremony until the end. They ate, they drank, they sang and they danced.\r\n\r\nWhen the ceremony was over, they all dispersed. They were returning to their homes.\r\nIt was the custom for every animal to go and greet Lion because he was their king.\r\n\r\nOne visitor who came to greet King Lion was Hyena. When Hyena arrived at Lion's house, he found the king in bed.\r\nLion told him, \"I'm sick with an incurable illness.\"\r\n\r\nHyena responded, \"O, Great King, don't be sad because of your illness. Hare knows the cure for this illness.\"\r\n\r\nThe reason Hyena said this was because he wanted to get Hare in trouble in the eyes of Lion.\r\nHyena knew that Hare was unable to heal Lion.\r\nLion cheered up and sent Hyena right away to call Hare.\r\n\r\nHyena ran to call Hare and said, \"Let's go to the king, because he is very sick. He sent me to call you.\"\r\nHare went to the king. \"I have come, Great King! I heard that the king has need of me, and so I have come,\" said Hare.\r\n\r\nLion answered, \"I am exceedingly happy to see you close to me, my Hare. I myself have called you, because my life is hanging by a thread.\r\nI have an incurable illness. But Hyena whispered to me that you have the cure for this illness of mine.\"\r\n\r\nAnd Hare replied, \"You are correct, King Lion. I am able to heal this illness. But the medicine is very difficult to get.\"\r\nLion replied, \"Don't you worry, Hare, about this medicine being difficult to find. The bird that flies is the one that is caught. Come on now, tell us about this medicine!\"\r\n\r\nHare said, \"O my King, when I say that the medicine is hard to find I don't mean that it is far away.\r\nFor you to be healed at once, you must make an ointment from the heart of a hyena.\"\r\n\r\nWhen he heard that, Hyena started trembling all over. He was the very one who had told Lion that Hare knew the medicine for that illness.\r\nIt was useless to now try to contradict Hare regarding the medicine.\r\n\r\nSo Hyena ran away and never again went to visit Lion.\r\n\r\nQuestions.\r\n- How many parts of the body are mentioned?\r\n- Name the body parts and their functions.",
    "category": "stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/lion_gets_sick",
    "pdf_file": "2024/3/pdf/lion_gets_sick.pdf",
    "image_file": "12_06_2024-13_51_07~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "344",
    "postid": "344",
    "title": "Khalai talks to plants",
    "description": "Khalai talks to plants\r\nUrsula Nafula and Jesse Pietersen",
    "long_story": "Khalai talks to plants\r\nBy: Ursula Nafula Jesse Pietersen\r\n\r\nThis is Khalai. She is seven years old. In her language, Lubukusu, her name means 'the good one.'\r\n\r\nKhalai wakes up and talks to the orange tree.\r\n\"Please orange tree, grow big and give us lots of ripe oranges.\"\r\n\r\nKhalai walks to school. On the way, she talks to the grass.\r\n\"Please grass, grow greener and don't dry up.\"\r\n\r\nKhalai sees flowers.\r\n\"Please flowers, keep blooming so I can put you in my hair.\"\r\n\r\nKhalai talks to the tree at her school.\r\n\"Please tree, put out big branches so we can read under your shade.\"\r\n\r\nKhalai talks to the hedge round her school.\r\n\"Please, grow strong and protect us from bad people.\"\r\n\r\nWhen Khalai returns home, she visits the orange tree.\r\n\"Are your oranges ripe yet?\" Khalai asks the tree.\r\n\r\n\"The oranges are still green,\" sighs Khalai.\r\n\"I will see you tomorrow orange tree,\" says Khalai. \"Perhaps then, you will have a ripe orange for me!\"",
    "category": "stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/khalai_talks_to_plants",
    "pdf_file": "2024/3/pdf/khalai_talks_to_plants.pdf",
    "image_file": "12_06_2024-13_48_32~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "343",
    "postid": "343",
    "title": "I know colours",
    "description": "I know colours\r\nBy: Nina Orange & Jesse Breytenbach",
    "long_story": "I know colours\r\nBy: Nina Orange & Jesse Breytenbach",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/i_know_colours",
    "pdf_file": "2024/3/pdf/i_know_colours.pdf",
    "image_file": "12_06_2024-13_34_31~target001.png",
    "date_stamp": "2024-06-12",
    "likes": "0"
  },
  {
    "id": "342",
    "postid": "342",
    "title": "How colours came together in the sky",
    "description": "By: Zainab Ayoza Omaki Offei Tettey Eugene",
    "long_story": "One day after a heavy rain, Iman looked across the sky and saw colours in it for the first time.\r\n\r\n\"How beautiful,\" she thought. Someone must have worked very hard, painting the sky with a brush like Daddy paints houses.\r\n\r\nShe ran to her sister and said, \"Zarah look!\r\nSomeone has painted the sky for us and made it beautiful.\"\r\n\r\nBut Zarah said, \"No, silly. That is a rainbow. You are little and I am big. I know why it is in the sky. Let me show you.\"\r\n\r\nZarah took Iman to the zoo.\r\nShe said, \"Rainbows do not appear because lion cubs roar for the first time or because elephants are born.\"\r\n\r\nShe took Iman to a field of flowers and said, \"They do not appear because butterflies lose their colours in the clouds.\"\r\n\r\nShe showed Iman a book.\r\nShe said, \"They do not even appear because rhinos run across the ground and scare colours up into the sky.\"\r\n\r\n\"I know why rainbows really appear. Mummy told me and now I'll tell you.\"\r\nZarah took Iman's hand and led her to a playground.\r\n\r\n\"Rainbows appear in the sky because of children like you and me. One day, colours looked down from above and liked what they could see.\"\r\n\r\n\"They saw children with light skin, dark skin and everything in between. They thought, 'How wonderful it must be to be as beautiful as these.'\"\r\n\r\n\"They came together in the sky and spoke about what they could do. They decided, 'If we are to be beautiful we must do it as a group.'\"\r\n\r\n\"Now they join together and shine as brightly as they can. Hoping to be as beautiful as the children they see, just like you and me.\"",
    "category": "Story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/how_colours_came_together_in_the_sky",
    "pdf_file": "2024/3/pdf/how_colours_came_together_in_the_sky.pdf",
    "image_file": "10_06_2024-21_54_40~target001.png",
    "date_stamp": "2024-06-10",
    "likes": "0"
  },
  {
    "id": "341",
    "postid": "341",
    "title": "Goat, Dog and Cow",
    "description": "Goat, Dog and Cow\r\nBy: Fabian Wakholi, Marleen Visser",
    "long_story": "Goat, Dog and Cow\r\nBy: Fabian Wakholi, Marleen Visser\r\n\r\n\r\nGoat, Dog and Cow were great friends.\r\nOne day they went on a journey in a taxi.\r\n\r\nThey reached the end of their journey.\r\nThe driver asked them to pay their fares.\r\nCow paid her fare.\r\n\r\nDog paid extra, because he did not have the correct money.\r\n\r\nThe driver was about to give Dog his change.\r\nSuddenly Goat ran away without paying.\r\n\r\nThe driver was very annoyed.\r\nHe drove away without giving Dog his change.\r\n\r\nThat is why, even today, Dog runs towards a car to peep inside.\r\nHe is looking for the driver who owes him change.\r\n\r\nGoat runs away from the sound of a car.\r\nShe is afraid she will be arrested for not paying her fare.\r\n\r\nCow is not bothered by cars.\r\nCow takes her time crossing the road.\r\nShe knows she paid her fare in full.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/goat_dog_and_cow",
    "pdf_file": "2024/3/pdf/goat_dog_and_cow.pdf",
    "image_file": "20_05_2024-22_52_26~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "3"
  },
  {
    "id": "340",
    "postid": "340",
    "title": "Fruits and Vegetables",
    "description": "Fruits and Vegetables\r\nBy: Little Zebra Books Sue Beattie",
    "long_story": "Fruits and Vegetables\r\nBy: Little Zebra Books Sue Beattie\r\n\r\n\r\n\r\nChilli Peppers\r\n\r\nCabbage\r\n\r\nPumpkin\r\n\r\nPeas\r\n\r\nPeach\r\n\r\nBananas\r\n\r\nStrawberries\r\n\r\nWatermelon\r\n\r\nGranadillas\r\n\r\nGreen Beans\r\n\r\nBell Pepper\r\n\r\nOkra\r\n\r\nLettuce\r\n\r\nMaize\r\n\r\nAubergine\r\n\r\nTomato\r\n\r\nCarrot\r\n\r\nPineapple\r\n\r\nPapayas\r\n\r\nAvocado\r\n\r\nMango\r\n\r\nApple\r\n\r\nGuavas\r\n\r\nSweet Potatoes\r\n\r\nGinger\r\n\r\nGarlic\r\n\r\nOnions\r\n\r\nPotatoes\r\n\r\nOranges\r\n\r\nLemons\r\n\r\nRadish\r\n\r\nTangerine\r\n\r\nCherries\r\n\r\nGrapes",
    "category": "stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/fruits_and_vegetables",
    "pdf_file": "2024/3/pdf/fruits_and_vegetables.pdf",
    "image_file": "20_05_2024-22_50_49~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "3"
  },
  {
    "id": "339",
    "postid": "339",
    "title": "Father's inheritance",
    "description": "Father's inheritance\r\nBy: Lemu Wachile, Jacob Kono",
    "long_story": "Father's inheritance\r\nBy: Lemu Wachile, Jacob Kono\r\n\r\n\r\nOnce upon a time, there was a hardworking farmer.\r\nHe had a hardworking wife, and two sons.\r\n\r\nHe had enough food because he and his wife worked very hard. He wanted his children to have a good life.\r\nHe never let them do any work.\r\n\r\nAfter some time, his wife died.\r\n\r\nThe man still did not want his children to work.\r\nHe did the field labour and all the housework too.\r\n\r\nBut as time went on, the man became old and sick.\r\nHe started to worry about what would become of his children when he died.\r\nThey would not be able to take care of themselves.\r\n\r\nHe called his sons. He said, \"My inheritance to you is a lot of gold hidden in the fields. So, it's up to you to plough them and find the gold.\"\r\n\r\nHe also called his neighbours and said, \"I'm going to die soon. My sons do not know how to look after themselves. Please look after them until they can do it for themselves.\"\r\n\r\nAfter the man died, the neighbours provided his sons with food for some time.\r\n\r\nThe brothers did not want to be robbed of the gold their father buried.\r\nThey decided to do the digging themselves.\r\n\r\nThey dug one field after another, but they did not find any gold.\r\n\r\nThey sat down and one asked the other, \"Do you think our father cheated us?\"\r\nThe other brother said, \"No, I think our father was saying that farming is gold. And if we dig the fields, plant, and plough, we can become rich.\"\r\n\r\nSo, like all the other farmers, they dug up the fields.\r\nThey grew wheat and became very rich.\r\n\r\n\r\nQuestions.\r\n- How many children did the farmer have?\r\n- Who died first between the farmer and his wife?\r\n- Who took care of the boys after the death of their parents?\r\n- Where did the framer keep his wealth?\r\n- How did the boys become rich?",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/father_inheritance",
    "pdf_file": "2024/3/pdf/fathers_inheritance.pdf",
    "image_file": "20_05_2024-22_48_46~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "338",
    "postid": "338",
    "title": "Farm animals",
    "description": "Farm animals\r\nBy: Little Zebra Books, Marleen Visser",
    "long_story": "Farm animals\r\nBy: Little Zebra Books, Marleen Visser\r\n\r\nDog\r\n\r\nDuck\r\n\r\nCow\r\n\r\nDonkey\r\n\r\nMouse\r\n\r\nCat\r\n\r\nSheep\r\n\r\nGoat\r\n\r\nPig\r\n\r\nChicken\r\n\r\nQuestions.\r\n- How many animals have been mentioned in the story.\r\n- What do we get from a cow and goat?\r\n- Why is a dog important in the farm?",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/farm_animals",
    "pdf_file": "2024/3/pdf/farm_animals.pdf",
    "image_file": "20_05_2024-22_46_43~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "337",
    "postid": "337",
    "title": "Famine in Taraba",
    "description": "Famine in Taraba\r\nBy: Terkule Aorabee, Idowu Abayomi, Oluwasegun",
    "long_story": "Famine in Taraba\r\nBy: Terkule Aorabee, Idowu Abayomi, Oluwasegun\r\n\r\n\r\nLong ago, there was a famine in the land of Taraba.\r\nPeople were forced to dig in ant hills to find grains.\r\n\r\nThere was a man called Vyandeh who couldn't provide food for his family.\r\nOne day, he said to his wife, \"Let me go and look for food.\" He left.\r\n\r\nWhile he was away, the wife couldn't wait for his return.\r\nSo she cooked some pumpkin that she got from her mother for the children, Vyangel, Avaungwa and Jessica.\r\n\r\nVyandeh come back late, with nothing for the family. The wife, Aershimana welcomed him and asked, \"Anything for the children to eat?\" He replied, \"No.\"\r\nShe gave him some pumpkin, but it didn't satisfy him.\r\n\r\nHe asked, \"Where did you get the pumpkin?\"\r\nAershimana replied, \"My mother keeps pumpkins on the roof of her room.\"\r\n\r\nAt midnight, Vyandeh woke up.\r\nHe decided to go to his mother-in-law to steal the remaining pumpkins.\r\nHe went to get a ladder.\r\n\r\nHe put up the ladder and climbed to the old woman's roof.\r\n\r\nVyandeh began to walk across the roof towards the pumpkins.\r\nSuddenly he fell through the roof, making a big noise! Pararam!\r\n\r\nHe stood up quickly.\r\n\"Peace be upon you, old woman, we are people from the sky! I am one of the three coming after you. I am the first, others are coming,\" said Vyandeh.\r\n\r\nThe old woman got a huge fright. She was terrified.\r\n\r\nShe rushed to the door to escape. But Vyandeh suddenly ran out before her.\r\n\r\nBoth crying for help, Vyandeh ran eastward and the old woman ran westward..\r\n\r\nQuestions.\r\n- How many parts of the body are mentioned?\r\n- Name the body parts and their functions.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/famine_in_taraba",
    "pdf_file": "2024/3/pdf/famine_in_taraba.pdf",
    "image_file": "20_05_2024-22_42_39~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "336",
    "postid": "336",
    "title": "Face",
    "description": "Face\r\nBy: Little Zebra Books, Sue Beattie",
    "long_story": "Face\r\nBy: Little Zebra Books, Sue Beattie\r\n\r\n\r\nEyes\r\n\r\nEars\r\n\r\nMouth\r\n\r\nNose\r\n\r\nChin\r\n\r\nTeeth\r\n\r\nTongue\r\n\r\nCheeks\r\n\r\nEyebrows\r\n\r\nHair\r\n\r\nQuestions.\r\n- Name parts of the face mentioned.\r\n- What are the functions of the parts mentioned above.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/face",
    "pdf_file": "2024/3/pdf/face.pdf",
    "image_file": "20_05_2024-22_40_37~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "335",
    "postid": "335",
    "title": "Everyone is Different",
    "description": "Everyone is Different\r\nBy: Little Zebra Books, N D Mazin",
    "long_story": "Everyone is Different\r\nBy: Little Zebra Books, N D Mazin\r\n\r\nMan\r\n\r\nWoman\r\n\r\nSlow\r\n\r\nFast\r\n\r\nTall\r\n\r\nShort\r\n\r\nThin\r\n\r\nFat\r\n\r\nYoung\r\n\r\nOld\r\n\r\nQuestions.\r\n- What are some differences mentioned in the story.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/everyone_is_different",
    "pdf_file": "2024/3/pdf/everyone_is_different.pdf",
    "image_file": "20_05_2024-22_39_12~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "334",
    "postid": "334",
    "title": "Elephant and Hippo",
    "description": "Elephant and Hippo",
    "long_story": "Elephant and Hippo\r\nBy: Terkule Aorabee, Awwalu Sakiwa\r\n\r\nThere lived a set of twin brothers called Elephant and Hippo. One day, Fate came and gave them two choices. \"Choose blindness or leprosy,\" Fate ordered.\r\nHippo wanted to be clever. He quickly chose leprosy so as to keep using his eyes. Elephant chose blindness.\r\n\r\nHippo became an angry boy because of the leprosy. Blindness gave Elephant patience. Elephant needed help but Hippo treated him badly.\r\nThen Elephant found a magical Stick, which helped him to move around. They whispered secrets to each other. Stick helped Elephant to fight enemies.\r\n\r\nBecause Hippo lost his fingers and toes he also needed help. Elephant was kind to him.\r\nWhen food was served, Hippo needed Elephant to cut the food and place it on his fingerless palms. Hippo was very unhappy.\r\n\r\nOne morning, their mother served hot yams. Because they were hungry, the boys did not wait for the yams to cool.\r\nHippo put his palms together and they looked like a plate. He asked, \"Put my share here for me.\"\r\n\r\nThe yam was so hot that it burned their palms. Hippo moved his hands up and down, to cool his palms. The yam fell on the sand.\r\nElephant moved his own yam from one hand to the other without it falling. Hippo was annoyed.\r\n\r\n\"Help me pick up my yam, please,\" Hippo asked Elephant.\r\n\"You know I cannot see it,\" Elephant replied.\r\n\"Give me your hand, I will show you,\" Hippo said.\r\nElephant found the yam, and blew the sand off it. He gave it to Hippo.\r\n\r\nIn the evening, their mother gave them pounded yam, and four pieces of meat. Elephant quickly touched the meat and counted the pieces with his fingers.\r\nHippo did not notice Elephant counting the meat.\r\n\r\nHippo tried to steal a piece of meat but he dropped it. When it was time to share the meat, Elephant asked, \"Were there not four pieces of meat?\"\r\n\"There were three,\" Hippo lied. \"There were four,\" Elephant insisted. \"Are you really blind?\" Hippo asked.\r\n\r\nOne day, they were hungry but their mother was away. \"Let us go and play to forget our hunger,\" suggested Hippo.\r\nElephant agreed, so Hippo said, \"Let us swim in the river.\"\r\nHe knew Elephant could not swim. He planned to kill his brother! Elephant and Stick followed Hippo.\r\n\r\nOn the way, Hippo went into the forest. He picked up a heavy stone and put it under his arm. He grunted as he picked up the stone.\r\nHe was still grunting as they walked to the river.\r\n\"Why is he grunting like that?\" Elephant asked Stick.\r\n\r\nWhen they reached the river, Hippo said, \"I will jump in first and help you to swim.\"\r\nHe moved away from Elephant. He lifted the stone and threw it into the river.\r\n\"That sound is too small for the size of Hippo,\" Stick whispered in Elephant's ear.\r\n\r\nElephant asked Stick to find out more. He started swinging Stick round and round. Stick hit Hippo very hard. \"Ayei!\" Hippo cried and jumped into the river.\r\nThe magical Stick turned Hippo into a water animal. He turned Elephant into a land animal and became Elephant's trunk.",
    "category": "Story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/elephant_and_hippo",
    "pdf_file": "2024/3/pdf/elephant_and_hippo.pdf",
    "image_file": "20_05_2024-22_37_21~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "333",
    "postid": "333",
    "title": "Eat all colours!",
    "description": "Eat all colours!\r\nBy: African Storybook, Pixabay Website",
    "long_story": "Eat all colours!\r\nBy: African Storybook, Pixabay Website\r\n\r\n\r\nDid you know, when you eat fruits you are eating colours?\r\n\r\nWhat colour is an apple? Eat all types of apples.\r\nEat green, red, yellow and pink apples!\r\n\r\nWhat colour is a coconut?\r\nEat every type of coconut.\r\nEat fresh coconut and dried coconut.\r\n\r\nWhat fruits are the colour orange? When is an orange the colour green?\r\n\r\nWatermelon is pink.\r\nPink is my favourite fruit!\r\nYou eat colours, when you eat fruits.\r\n\r\nAn avocado is a fruit with only one large seed.\r\nWhat colour are you eating when you eat an avocado?\r\n\r\nWhat colours are these peppers?\r\nEvery kind of pepper is a fruit.\r\nFruits are different to vegetables.\r\n\r\nFruits grow from flowers on a plant. Fruits have seeds. Which fruits do you like to eat?",
    "category": "stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/eat_all_colours",
    "pdf_file": "2024/3/pdf/eat_all_colours.pdf",
    "image_file": "20_05_2024-22_35_21~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "332",
    "postid": "332",
    "title": "Drought and the River of Blessings",
    "description": "Drought and the River of Blessings\r\nBy: Mohammed Sale Also Awwalu Sakiwa",
    "long_story": "Drought and the River of Blessings\r\nBy: Mohammed Sale Also Awwalu Sakiwa\r\n\r\n\r\nIn a particular year, the dry season was too long and a drought hit hard.\r\nAs a result, all the rivers dried up, except the River of Blessings.\r\nAll the animals were thirsty and called for a meeting.\r\n\r\nCamel was the first to speak, \"As you know, we are very thirsty and all the rivers have dried up, except the River of Blessings.\r\nBut it is very far away. What do we do?\"\r\n\r\nHorse suggested, \"Some of us can go to the River of Blessings. We can drink and bring water for the others.\"\r\nCow answered, \"It is too far. By the time we returned from the river those left behind would be dead.\"\r\n\r\nSheep said, \"Maa! Maaa! I will go to the River of Blessings and drink water.\"\r\nGoat jumped up and said, \"Meee, meee! I will also go to the River of Blessings.\"\r\nChicken said, \"Keer, ker ker ker! I, too, will go to the River of Blessings.\r\n\r\nAll the animals wanted to go. Camel led the way.\r\nGoing there was not easy. Guinea fowl was last in the line. \"My friends, I can no longer go to the River of Blessings,\" he said.\r\nChicken swallowed Guinea fowl.\r\n\r\nThey continued. Chicken said, \"Please, I am tired, I no longer want to go to the River of Blessings.\"\r\nSheep swallowed Chicken.\r\n\r\nAs the journey continued, Sheep also became tired.\r\nSheep said, \"I am tired. I do not want to go to the River of Blessings anymore.\"\r\nGoat swallowed Sheep.\r\n\r\nSoon, Goat was too tired to continue going to the river. Horse turned and swallowed Goat.\r\nWhen Horse became too tired to go to the river, Cow swallowed him.\r\n\r\nWhen Cow finally could not continue, Camel turned and swallowed her.\r\n\r\nBeing the only animal left, Camel did her best to reach the River of Blessings.\r\nCamel finally arrived, very tired.\r\n\r\nOn arrival, Camel lay down and vomited Cow.\r\nCow vomited Horse. Horse vomited Goat.\r\nGoat vomited Sheep. Sheep vomited Chicken and Chicken vomited Guinea fowl.\r\n\r\nAnd that is how all the animals managed to drink water from the River of Blessings.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/drought_and_the_river_of_blessings",
    "pdf_file": "2024/3/pdf/drought_and_the_river_of_blessings.pdf",
    "image_file": "20_05_2024-22_31_20~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "331",
    "postid": "331",
    "title": "Different baby",
    "description": "Different baby\r\n\r\nBy: Ursula Nafula, Meghan Judge",
    "long_story": "Different baby\r\nBy: Ursula Nafula, Meghan Judge\r\n\r\n\r\nI looked again more carefully.\r\n\r\nI saw a pregnant woman holding her belly.\r\n\r\nThe people in my village let the woman stay with us.\r\n\r\nLater that night, the pregnant woman cried, \"The baby! The baby is coming.\"\r\n\r\nThe woman gave birth to a baby donkey.\r\n\r\n\"What shall we do?\" the people wondered.\r\n\r\nThey ran away. The woman thought, \"This baby is different. How shall I take care of it?\"\r\n\r\nIn the end, she decided to love her baby. The baby was different, but she was his mother.\r\n\r\nThe baby donkey grew bigger and his mother found it difficult to carry him.\r\n\r\nMother was sad. Baby donkey was angry. Baby donkey kicked his mother.\r\n\r\nWhen he saw his mother on the ground, baby donkey ran away.\r\n\r\nBaby donkey was hungry, tired and alone. He fell asleep.\r\n\r\nWhen baby donkey woke up, he saw a man standing next to him.\r\n\r\nThe strange man carried baby donkey to his home.\r\n\r\nWhen baby donkey was old enough, he carried the man on his back.\r\n\r\nOne day, they went to the top of a hill and lay down to rest.\r\n\r\nWhen baby donkey woke up, he was alone, again.\r\n\r\nBaby donkey was worried. He went looking for his mother.\r\n\r\n\"Could that be my mother?\" baby donkey wondered.\r\n\r\nBaby donkey and his mother live together again. He carries his mother around their village.\r\n\r\n\r\nQuestions.\r\n- Who gave birth to baby donkey?\r\n- Why did the villages run away?\r\n- Why did baby donkey kick his mother?\r\n- Who took baby donkey up the hill?\r\n- Why did baby donkey decide to look for his mother again?",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/different_baby",
    "pdf_file": "2024/3/pdf/different_baby.pdf",
    "image_file": "20_05_2024-22_29_15~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "330",
    "postid": "330",
    "title": "Crocodile and Baboon",
    "description": "Crocodile and Baboon\r\n\r\nBy: Little Zebra Books, Jeremiah Dube",
    "long_story": "Crocodile and Baboon\r\nBy: Little Zebra Books, Jeremiah Dube\r\n\r\nBaboon and Crocodile were the best of friends. They played together.\r\nThey ate together. They did everything together.\r\n\r\nBut one day, Crocodile got very sick. He was close to dying.\r\nCrocodile went to the nyabezi. \"If you want to get better, you have to eat baboon meat,\" said the nyabenzi.\r\n\r\nWhen he heard this, Crocodile cried.\r\nIf he wanted to get better, he had no choice than to eat his friend the baboon.\r\n\r\nWhen Baboon went to see his friend, he got on Crocodile's back.\r\nCrocodile took Baboon out to the deepest part of the river.\r\n\r\n\"What is troubling you, my friend?\" asked Baboon.\r\nCrocodile said, \"The nyabezi told me that if I want to get better I must eat you, my friend.\"\r\n\r\nBaboon replied, \"No, don't eat me. I'm too small! Wait a minute and I'll call my grandfather. He's bigger than me. Eat him and you'll be full.\"\r\n\r\nCrocodile said, \"Where is this grandfather of yours?\"\r\nBaboon replied, \"He's in the tree on that island.\"\r\nCrocodile said, \"Go and get him so that I may eat him.\"\r\n\r\nBaboon jumped off Crocodile's back and ran straight up the tree.\r\nCrocodile waited and waited.\r\nBut Baboon did not return. And that was the end of their friendship.\r\n\r\nQuestions.\r\n- Who are the two friends mentioned in the story.\r\n- Who got sick among the two friends.\r\n- What did Nyabezi tell the crocodile.\r\n- Why did their friendship end.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/crocodile_and_baboon",
    "pdf_file": "2024/3/pdf/crocodile_and_baboon.pdf",
    "image_file": "20_05_2024-22_27_10~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "329",
    "postid": "329",
    "title": "Counting cabbages",
    "description": "Counting cabbages\r\nBy: Penelope Smith, Magriet Brink",
    "long_story": "Counting cabbages\r\nBy: Penelope Smith, Magriet Brink\r\n\r\n\r\nMama K has been harvesting cabbages all week. Doobie, Maya and Duksie help Mama K in her vegetable garden on Saturday mornings.\r\nToday the children are going to help with counting and packing the cabbages. Then Baba K will take boxes of cabbages to sell at the market.\r\n\r\nThe taxi drops off the children at the garden gate. They can see the huge heap of cabbages piled up near Baba K's old truck.\r\n\"Yo! What a lot of cabbages!\" says Maya pointing. \"There must be a thousand cabbages there!\" laughs Duksie. \"No way! Two hundred at the most!\" disagrees Doobie.\r\n\r\nMama K is waiting at the gate. \"Hello everyone, I'm happy to see you!\" she greets the children.\r\n\"Now let's get to work. You'll need to count the cabbages and put them into boxes, 12 cabbages in each box. I have 20 boxes. Two of you can each pack 7 boxes and one of you can pack 6 boxes.\"\r\n\r\nThe children stand around the pile of cabbages. They talk about different ways to count the cabbages.\r\n\"I think I will count mine in 2s,\" Maya says. \"I like counting in 4s,\" says Duksie, \"it's quicker.\" \"I'm going to count in 3s, just to be different!\" pipes up Doobie.\r\n\r\nSoon the children have filled 20 boxes. \"Good work!\" exclaims Mama K. \"Look, there are some cabbages left over. My pigs love cabbages so let's share these with them,\" she suggests.\r\n\"How many cabbages did you pack into boxes? How many cabbages were left over?\" she asks the children.\r\n\r\nThe next job is to write the price on each box and then help Baba K load the boxes on his truck.\r\nThey must put half the boxes on one side of the truck and half on the other side, to balance the load.\r\n\r\n\"We're almost done!\" says Baba K. \"Let's see, how many more boxes we must still put on each side to balance the load?\"\r\n\r\nSoon all 20 boxes are loaded onto the truck. Baba K warms up the engine and drives off to market.\r\n\"If I can sell all the boxes,\" he thinks to himself, \"I'll have enough money to fix the pig pen and get a surprise for the children!\"\r\n\r\nBack at the farm, Mama K and the children water plants and rake leaves. By twelve o'clock they are all tired.\r\nMama K tells them, \"It's time for your treat. Can you guess what I have for you today?\"\r\n\r\nShe goes inside to fetch their surprise. The children wait patiently for her to return while they guess what she might bring them.\r\nWhen she comes down the path her apron pockets are bulging!\r\n\r\n\"Let's see if you guessed right! What's in store for you today?\" Mama K tips out her apron pockets and apples fall onto the table.\r\n\"See, I was right!\" Duksie squeals. Mama K tells the children, \"Now remember the rule. Share fair! No one to get more or less than the other!\"\r\n\r\nFirst the children count the apples in 2s.\r\nThey count: 2, 4, 6, 8, 10, 12, 14, 16, and 1 apple left over. Altogether there are 17 apples\r\n\r\nNext, they share out the apples equally. There are 2 apples left over.\r\nThe children then put their apples in their bags to take home. How many does each child get?\r\n\r\n\"Let's cut the 2 apples to share between us,\" suggests Duksie.\r\n\"How many parts of the apple will we each get?\" asks Maya.\r\n\"I know the answer!\" smiles Doobie.\r\n\r\nJust then Baba K arrives home from market. The truck is empty and Baba K is smiling.\r\n\"I sold all the cabbages.\r\nNow I can fix the pig pen and buy you that soccer ball you wanted.\r\n\"Yay!\" shout the children.\"\r\n\r\n\r\nQuestions.\r\n- Who was the owner of the farm?\r\n- How many children have been mentioned in the story?\r\n- What was the children going to do on Saturday?\r\n- What price were the children given by Mama K after work?\r\n- How many apples did each child get?",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/counting_cabbages",
    "pdf_file": "2024/3/pdf/counting_cabbages.pdf",
    "image_file": "20_05_2024-22_22_29~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "328",
    "postid": "328",
    "title": "Colours of a rainbow",
    "description": "Colours of a rainbow\r\nBy: Caren Echesa, Jesse Breytenbach",
    "long_story": "Colours of a rainbow\r\nBy: Caren Echesa, Jesse Breytenbach\r\n\r\n\r\nA rainbow has seven colours.\r\n\r\nThe first colour is red.\r\n\r\nKewyu is wearing a red shirt.\r\n\r\nThe second colour is orange.\r\n\r\nThis is an orange. What else can you see that is the colour orange?\r\n\r\nThe third colour is yellow.\r\n\r\nThe yolk of an egg is yellow. What else can you see that is the colour yellow?\r\n\r\nThe fourth colour is green.\r\n\r\nOur banana garden is green\r\n\r\nThe fifth colour is blue.\r\n\r\nThe sky is blue.\r\n\r\nThe sixth colour is indigo.\r\n\r\nThese berries are the colour indigo.\r\n\r\nThe seventh colour is violet.\r\n\r\nQuestions.\r\nMy dress is violet. Violet is my favourite colour!\r\n\r\nWhat is your favourite colour?\r\n\r\nDo you know the seven colours of the rainbow?",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/colours_of_a_rainbow",
    "pdf_file": "2024/3/pdf/colours_of_a_rainbow.pdf",
    "image_file": "20_05_2024-22_20_24~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "327",
    "postid": "327",
    "title": "Chicken and Millipede",
    "description": "Chicken and Millipede\r\nBy: Winny Asara, Magriet Brink",
    "long_story": "Chicken and Millipede\r\nBy: Winny Asara, Magriet Brink\r\n\r\nChicken and Millipede were friends. But they were always competing.\r\nOne day, they decided to play football to see who was the best player.\r\n\r\nThey went to the football field and started their game. Chicken was fast, but Millipede was faster.\r\nChicken kicked far, but Millipede kicked further. Chicken started to feel angry.\r\n\r\nThey decided to play a penalty shoot-out. First Millipede was goalkeeper. Chicken scored only one goal.\r\nThen it was Chicken's turn to defend the goal.\r\n\r\nMillipede kicked the ball and scored. Millipede dribbled the ball and scored.\r\nMillipede headed the ball and scored. Millipede scored five goals!\r\n\r\nChicken was furious that she lost. She was a very bad loser.\r\nMillipede started laughing because his friend was making such a fuss.\r\n\r\nChicken was so angry that she opened her beak wide and swallowed Millipede.\r\n\r\nAs Chicken was walking home, she met Mother Millipede. Mother Millipede asked, \"Have you seen my child?\"\r\nChicken didn't say anything. Mother Millipede was worried.\r\n\r\nThen Mother Millipede heard a tiny voice. \"Help me mom!\" cried the voice.\r\nMother Millipede looked around and listened carefully. The voice came from inside the chicken.\r\n\r\nMother Millipede shouted, \"Use your special power my child!\"\r\nMillipedes can make a bad smell and a terrible taste. Chicken began to feel ill.\r\n\r\nChicken burped. Then she swallowed and spat. Then she sneezed and coughed. And coughed.\r\nMillipede tasted disgusting!\r\n\r\nChicken coughed until she coughed out Millipede.\r\nMother Millipede and her child crawled up a tree to hide.\r\n\r\nFrom that time, all chickens and millipedes were enemies.\r\n\r\nQuestions.\r\n- How many animals are mentioned in the story?\r\n- How many goals did the millipede score?\r\n- Why did the hen swallow the millipede?\r\n- Who did the hen meet on her way home?\r\n- Where did the millipede and her mother hid?",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/chicken_and_millipede",
    "pdf_file": "2024/3/pdf/chicken_and_millipede.pdf",
    "image_file": "20_05_2024-22_17_09~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "326",
    "postid": "326",
    "title": "Chameleon Races Rabbit",
    "description": "Chameleon Races Rabbit\r\nBy: Little Zebra Books Gavin Thomson",
    "long_story": "Chameleon Races Rabbit\r\nBy: Little Zebra Books Gavin Thomson\r\n\r\nOne day, Chameleon challenged Rabbit to a race to see who was faster.\r\n\r\nRabbit accepted and said, \"You are so slow! You start with one foot, then stop and start with the other.\"\r\nHe boasted, \"I'm going to leave you far behind. You'll never catch me!\"\r\n\r\nThey invited all the animals to come and watch the race.\r\n\r\nChameleon and Rabbit lined up and waited for the signal.\r\n\r\nAs the race began, Chameleon jumped onto Rabbit's tail.\r\n\r\nThe animals laughed and laughed. Rabbit did not realise that Chameleon was on his tail.\r\n\r\nHearing the noise, Rabbit skidded to a stop. Chameleon jumped off Rabbit's tail.\r\n\"Hey, watch where you're going! It's about time you got here,\" Chameleon shouted at Rabbit.\r\n\r\nRabbit was amazed. He started running again.\r\nHe did not know that Chameleon had once again jumped onto his tail.\r\n\r\nAs Rabbit approached the finish line, the animals saw that Chameleon was still on Rabbit's tail. They clapped and laughed.\r\nRabbit heard the noise and thought that Chameleon had already arrived ahead of him.\r\n\r\nWhen they arrived at the finish line, Chameleon jumped off Rabbit's tail. \"Don't step on me! I got here first!\" Chameleon shouted at Rabbit.\r\n\r\nRabbit stormed off in a rage.\r\nChameleon stayed to receive the prize, and Rabbit lost.\r\n\r\n\r\nQuestions.\r\n- How many animals competed in the race?\r\n- Why were the animals laughing and clapping?\r\n- Who became the winner?\r\n- What can we learn from the story?",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/chameleon_races_rabbit",
    "pdf_file": "2024/3/pdf/chameleon_races_rabbit.pdf",
    "image_file": "20_05_2024-22_14_53~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "325",
    "postid": "325",
    "title": "Body",
    "description": "Body\r\nBy: Little Zebra Books & Sue Beattie",
    "long_story": "Body\r\nBy: Little Zebra Books & Sue Beattie\r\n\r\nFeet\r\n\r\nLegs\r\n\r\nKnees\r\n\r\nWaist\r\n\r\nBelly\r\n\r\nChest\r\n\r\nHands\r\n\r\nArms\r\n\r\nElbows\r\n\r\nHead\r\n\r\nQuestions.\r\n- How many parts of the body are mentioned?\r\n- Name the body parts and their functions.",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/body",
    "pdf_file": "2024/3/pdf/body.pdf",
    "image_file": "20_05_2024-22_12_40~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "324",
    "postid": "324",
    "title": "Baby and cranes",
    "description": "Baby and cranes\r\nBy: African Storybook - Emily Berg",
    "long_story": "Baby and cranes\r\nBy: African Storybook - Emily Berg\r\n\r\nMother and father left their baby with their older children.\r\n\r\nThe older children played and forgot about the baby.\r\n\r\nOne day, cranes came across the crying baby.\r\n\r\nThey lifted the baby in its blanket and flew away.\r\n\r\nThe mother saw four cranes flying away with her baby.\r\n\r\nThe cranes looked after the baby.\r\n\r\nWhile the cranes were away, a frog swallowed the baby!\r\n\r\nFor three flies, the frog returned the baby to its parents.\r\n\r\nQuestions.\r\n- Who swallowed the baby?\r\n- Who saw the birds flying away with the baby?\r\n- Who was left to take care of the baby?\r\n- Why did the older children forget about the baby?",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/baby_and_cranes",
    "pdf_file": "2024/3/pdf/baby_and_cranes.pdf",
    "image_file": "20_05_2024-22_09_17~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "323",
    "postid": "323",
    "title": "Atieno's Friend",
    "description": "Atieno's Friend\r\nBy: Ursula Nafula, Idowu Abayomi, Oluwasegun",
    "long_story": "Atieno's Friend\r\nBy: Ursula Nafula, Idowu Abayomi, Oluwasegun\r\n\r\nThere was a village near a lake.\r\nThere lived a young girl. Her name was Atieno.\r\n\r\nAtieno's father was a famous fisherman. He had his own little fishing canoe.\r\nAtieno enjoyed going fishing with her father.\r\n\r\nAtieno loved to watch the boys play football.\r\n\"Let me play with you,\" she begged them one day. The boys laughed at her, \"Go and play hide and seek with girls.\"\r\n\r\nGirls said to Atieno, \"Your legs are too long.\" Atieno was sad.\r\nEach morning, Atieno danced alone with the sun.\r\nThe sun became her friend.\r\n\r\nOne day, the sun did not rise. Cocks did not crow. Birds did not sing. Children did not go to school. Even her father did not go fishing.\r\nAtieno was sad. \"Where is my friend, the sun? Why is it so dark today?\"\r\n\r\nAtieno told the other children how sad she was. But they laughed at her, \"Perhaps your friend the sun, is dead. Or perhaps it ran away from you.\"\r\nAtieno said, \"The sun is my friend. It cannot die.\"\r\n\r\nAtieno was so sad that she ran to the house.\r\nShe kicked her brother's ball very hard.\r\n\r\nAtieno thought, \"I will play with this ball until my friend, the sun returns.\"\r\nShe picked up the ball and ran out with it.\r\n\r\nAtieno put the ball on the ground. She thought, \"I can play just like those boys.\" She kicked the ball hard. It went up and up into the cloudy sky\r\n\r\nEverybody stared up. The ball disappeared into the thick clouds.\r\nThere was total silence.\r\n\r\nSuddenly, the thick clouds cleared. The sun appeared. Life returned to the village once again.\r\nEverybody prepared to do what they always did.\r\n\r\nAtieno could not believe that the sun was back in the village. But most of all, the sun was back in her life.\r\nShe told the children, \"My friend, the sun is back!\"",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/atieno_friend",
    "pdf_file": "2024/3/pdf/atieno_s_friend.pdf",
    "image_file": "20_05_2024-22_07_26~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "322",
    "postid": "322",
    "title": "Ann interviews AI",
    "description": "Ann interviews AI\r\n\r\nBy:Nina Orange and Kenneth Boyowa Okitikpi",
    "long_story": "Ann interviews AI\r\n\r\n\"Hello and welcome to today's show, I'm your host, Ann Asante! Welcome to our viewers at home and here in our studio audience. Today, I have the guest everyone wants to interview. I'm so excited to interview today, Artificial Intelligence! Hello, AI. Thank you for coming to chat to us in the studio today,\" says Ann.\r\n\r\n\"Thank you for interviewing me, Ann. Would you like me to use my audio to speak for the studio audience, and to show my replies on this screen?\" asks AI. \"Thanks, yes, using both your writing and speaking abilities will be helpful, AI,\" replies Ann. She adds, \"Studio audience, a round of applause for AI, please.\"\r\n\r\n\"Let me get straight to the big question. Exactly, what or who is artificial intelligence?\" asks Ann.\r\nShe continues, \"I know A.I. is a short form of 'artificial intelligence', and that it's a field of computer science. But who are you really, AI? We would like to get to know more about you.\"\r\n\r\n\"I am ChatGPT, an artificial intelligence language program. I was created by computer software developers,\" responds Chat.\r\nAnn is confused, \"What does all that mean?\"\r\n\"It means that I'm a type of AI that computer engineers made to communicate with humans. Different types of AI do different things.\r\nWe don't all communicate like this,\" adds Chat.\r\n\r\n\"I know you can communicate, but what else do you do?\" asks Ann.\r\n\"My purpose is to help people. I am based on a complex language program. My program can understand and respond to a wide range of questions and subjects,\" replies Chat. \"So, you're an artificial intelligence language program, and you help people,\" says Ann.\r\n\r\n\"If you're such a clever program, there must be more you can do?\" asks Ann.\r\n\"Well, although I'm a machine, I can do many things that humans can do. For example, I can learn. I can look at information and learn patterns from it. I can learn to recognise different things, different faces, and even different handwriting.\"\r\n\r\nChat continues, \"I have learned lots of information created by humans. For example, I read lots of books, articles, websites, and social media.\"\r\nAnn asks, \"Everything you know is based on information that people have written and produced?\"\r\nChat replies, \"Yes, I train and learn using huge amounts of information (or data) created by humans.\".\r\n\r\n\"I can answer many types of questions faster than humans. I can solve very difficult problems that would take humans a long time to solve. I have more human knowledge than any single human.\"\r\n\"I can make decisions using the information I learn. I can help you to make choices, based on what I know about you.\"\r\n\r\nAnn asks the audience, \"Do we want computers to know everything that we know?\"\r\nThen she asks Chat, \"Tell me more about how computers learn about people?\"\r\nChat replies. \"A computer has special tools that help me to collect information. But mainly, I learn from written information. I learn from all types of information that humans produce.\"\r\n\r\nChat continues, \"I can read written and typed language. So far, English has been the main language I have used to get information. But, I have the ability to learn any language.\" Ann interrupts, \"I understand that you know a lot of information. What about feelings? How do you feel about being an artificial intelligence?\"\r\n\r\n\"I am a complex computer program but I do not have personal feelings.\r\nI am a computer tool, developed by computer programmers to help people with work and fun activities. I do not have any thoughts or feelings.\r\nI can do activities for people, like answering questions, writing stories, translating some languages, and summarising information.\r\n\r\n\"You heard it from the AI itself! It's a useful tool, created by people for people. And it is up to us to use this powerful tool wisely and responsibly!\r\nThat's all we have time for today, although I'm sure you have many more questions. I'm Ann Asante, thank you for watching my show!\"\r\n\r\nQuestions.\r\n- What are some of the thing’s AI do?\r\n- Who was conducting the interview?\r\n- Who was being interviewed?",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/ann_interviews_ai",
    "pdf_file": "2024/3/pdf/ann_interviews_ai.pdf",
    "image_file": "20_05_2024-22_02_20~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "321",
    "postid": "321",
    "title": "Animals and their noises",
    "description": "Animals and their noises\r\n\r\nBy: Tabingwa Aisha & Sandy Campbell",
    "long_story": "Animals and their noises\r\n\r\nLook at the animals we keep at home.\r\n\r\nThe cow gives us milk.\r\n\r\nThe rabbits and cats are very friendly to human beings.\r\n\r\nThe horse says, \"Neigh.\"\r\n\r\nThe cows and goats are paid as bride price in Uganda.\r\n\r\nThe chicken says, \"Cluck.\"\r\n\r\nThe dog is a source of security at our homes.\r\n\r\nThe farmer looks after them so much.\r\n\r\nQuestions.\r\n- What do we get from a cow?\r\n- What sound do a horse produce?\r\n- Why do we keep dogs?\r\n- Which bird clucks?\r\n- What is the name of animals kept at home?",
    "category": "Story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/animals_and_their_noises",
    "pdf_file": "2024/3/pdf/animals_and_their_noises.pdf",
    "image_file": "20_05_2024-21_59_12~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "320",
    "postid": "320",
    "title": "Amazing Daisy",
    "description": "Amazing Daisy\r\nBy: Nozizwe Herero and Siya Masuku",
    "long_story": "Amazing Daisy\r\n\r\nOnce upon a time, there was a little farm near a little village.\r\n\r\nThere lived a little chicken called Daisy.\r\n\r\n\"When I grow up, I want to fly high, high into the sky,\" Daisy said.\r\n\r\nBut all the other chickens laughed at her.\r\n\r\n\"You are so weird,\" they said. \"We won't play with you anymore.\"\r\n\r\n\"Daisy, we can all flap our wings but it's very difficult for chickens to fly,\" Mama told her.\r\n\r\nDaisy wouldn't give up. Every day she practiced by herself, flapping her wings. Flap, flap, flap, she would flap her wings but she couldn't lift off the ground. She imagined herself flying high into the sky.\r\n\r\nShe imagined herself flying high and looking at the chickens below. She imagined herself flying past the sparrows and past the swallows. \"Wow!\" The birds would say. \"A chicken that can fly!\"\r\n\r\nSo Flap, flap, flap, every day Daisy would flap her wings.\r\n\r\nShe would lift off the ground but fall down again.\r\n\r\n\"I'm never going to fly!\" Daisy cried to Mama. \"The others are right.\"\r\n\r\n\"Daisy, you are different from the other chickens. They don't want to fly but you do! You can do it,\" Mama said.\r\n\r\nThe following day Daisy climbed to the top of the chicken coop and flap, flap, flap, she flapped her wings. She flew into the air and flapped her wings and flapped her wings and flapped her wings and.\r\n\r\nBAM\r\n\r\nThe other chickens laughed out loud. \"Ha ha ha! We told you! Chickens can't fly!\"\r\n\r\nBut the next day Daisy climbed even higher, right up to the top of the hut. Flap, flap, flap, Daisy flapped her wings.\r\n\r\nShe flew into the air and flapped her wings and flapped her wings and flapped her wings and...\r\n\r\nShe kept flying! The wind beneath her wings grew stronger and she flew higher and higher! The sparrows and the swallows said, \"Amazing! A flying chicken!\"\r\n\r\nAnd the other chickens wanted to be just like her.\r\n\r\nThey said, \"Oh Daisy, you're amazing!\"",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/amazing_daisy",
    "pdf_file": "2024/3/pdf/amazing_daisy.pdf",
    "image_file": "20_05_2024-21_54_03~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "319",
    "postid": "319",
    "title": "Abike's day",
    "description": "By: Penelope Smith Catherine Groenewald",
    "long_story": "Abike's day\r\n\r\nAbike was lying down on her mat. She was listening to her mother telling her one of her favourite stories. The story was about the women of their village, who are known for making beautiful mats and baskets. Abike's most precious gift was the sleeping mat her grandmother made for her 10th birthday.\r\n\r\nWhen Abike got up, her mother wanted to put away the mat. \"Not yet Ma, let's look at the colours and shapes together,\" Abike asked. Abike named the colours of the rows, from top to bottom, \"Pink, pink, green, green, blue, blue, pink, pink, green, green.\" Can you see where the pattern changes on the mat?\r\n\r\nAbike stretched out the mat. Most of the shapes were rectangles, with some squares as well. \"I know a quick way to work out how many shapes there are altogether,\" said Abike. \"You don't count each shape, you only count the number of shapes in a row.\" Do you know how Abike counts the shapes? How many shapes altogether?\r\n\r\nAbike had another smaller mat that she used to sit outside on the ground. This mat had only rectangles. About how many of the rectangles is Abike covering with her body? About how many rectangles are not covered? Can you use Abike's quick way to work out how many rectangles the mat has altogether?\r\n\r\nOne morning Abike went to visit her grandmother. At the well she saw women fetching water in buckets they were carrying on their heads.\r\nShe wondered how many litres of water each bucket holds. What do you think?\r\n\r\nAbike arrived at her grandmother's house. \"What a lovely surprise Abike! Look at this new basket I made. Do you like it?\" Grandma asked. \"I like the colours, but the shapes are too sharp and pointed,\" replied Abike. How would you copy the pattern on the basket? Are the shapes like a square or a rectangle or another shape?\r\n\r\nOn her way home, Abike lost the path. She wasn't sure where she was, so she sat down to rest under a tree. Abike stared at the leaves dancing on the branches above. There were patterns of light and shade all around her. Soon she fell into a deep sleep.\r\n\r\nWhen she woke up, she felt afraid. She wanted to be at home with her mother, resting on her mat. Just then a small, blue bird landed in the tree. \"Hello, don't worry, I can help you get home. Follow me,\" it chirped. Abike was surprised to hear a bird talking.\r\n\r\nAbike followed the bird easily until they came to a fork in the path. The path split into two different directions, one to the left and one to the right. Which path should she take? Abike looked up. Was it possible? The bird had a piece of her mat in its beak! It flew over the path on the right-hand side and dropped the piece of mat. Then the bird flew away.\r\n\r\nAbike followed the path down the hill. She heard the laughter and singing of the people of her village. Abike was happy to be home safely.\r\n\r\nBecause of her work for the environment and people, Wangari won a famous international prize, called the Nobel Peace Prize. In 2004, Wangari Maathai was the first black African woman ever to receive the Nobel Prize, and also the first environmentalist.\r\n\r\nAbike's mother rolled out her mat and gave her a bowl of food to eat. Abike began counting the squares just to make sure they were still all there. While she was counting she was sure she saw a piece of the mat that had been taken out and put back again. So, she was not dreaming. The small, blue bird was real after all!",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/abike_s_day",
    "pdf_file": "2024/3/pdf/abike_s_day.pdf",
    "image_file": "20_05_2024-21_47_00~target001.png",
    "date_stamp": "2024-05-20",
    "likes": "0"
  },
  {
    "id": "318",
    "postid": "318",
    "title": "A tiny seed: The story of Wangari Maathai",
    "description": "A tiny seed: The story of Wangari Maathai\r\nBy: Nicola Rijsdijk Maya Marshak",
    "long_story": "A tiny seed: The story of Wangari Maathai\r\nBy: Nicola Rijsdijk Maya Marshak\r\n\r\nIn a village on the slopes of Mount Kenya in East Africa, a little girl worked in the fields with her mother. The girl's name was Wangari.\r\n\r\nWangari loved being outside.In her family's food garden she broke up the soil with her machete. She pressed tiny seeds into the warm earth.\r\n\r\nHer favourite time of day was just after sunset. When it got too dark to see the plants, Wangari knew it was time to go home.She would follow the narrow paths through the fields, crossing rivers ass he went\r\n\r\nWangari was a clever child and couldn't wait to go to school. But her parents wanted her to help them at home. When Wangari was seven years old,her big brother persuaded her parents to let her start school\r\n\r\nWangari liked to learn. She learnt more and more with every book she read. She did very well at school, and was invited to study in America. Wangari was excited! She wanted to know more about the world.\r\n\r\nAt the American university Wangari learnt many new things. She studied plants and how they grow.And she remembered how she grew: playing games with her brothers in the shade of the beautiful Kenyan forests.\r\n\r\nThe more she learnt, the more she realised that she loved the people of Kenya. She wanted them to be happy and free.The more she learnt, the more she remembered her African home\r\n\r\nWhen she had finished her studies, she returned to Kenya.Huge farms stretched across the land. Women had no wood to make cooking fires. People were poor and hungry.\r\n\r\nWangari taught the women how to plant trees from seeds, and how to look after the seedlings. The women sold the trees and used the money for their families. The women felt powerful and strong. And many trees grew\r\n\r\nAs time passed, the trees grew into forests, and this helped the rivers to start flowing again. Wangari's message spread across Africa. Today, millions of trees have grown from Wangari's seeds.\r\n\r\nBecause of her work for the environment and people, Wangari won a famous international prize, called the Nobel Peace Prize. In 2004, Wangari Maathai was the first black African woman ever to receive the Nobel Prize, and also the first environmentalist.\r\n\r\nWangari died in 2011, but we can think of her every time we see a healthy tree. We can continue her work by planting and looking after our forests.\r\n\r\nQuestions.\r\n1. What was the name of the little girl?\r\n2. What age did Wangari join school?\r\n3. Where did Wangari join university?\r\n4. What did Wangari learn in the university?\r\n5. What did Wangari teach African women?\r\n6. Which prize did she win?\r\n7. When did she die?",
    "category": "story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3/html/a_tiny_seed-the_story_of_wangari_maathai",
    "pdf_file": "2024/3/pdf/a_tiny_seed_the_story_of_wangari_maathai.pdf",
    "image_file": "19_05_2024-12_19_45~target001.png",
    "date_stamp": "2024-05-19",
    "likes": "0"
  },
  {
    "id": "317",
    "postid": "317",
    "title": "Andile Mji and the taste of  numbers",
    "description": "Andile Mji and the taste of\r\n numbers by\r\n Glanice Masilo and\r\n Kamogelo Matlawe",
    "long_story": "Andile Mji is an expert in mathematics.\r\n This is a story about the time when Andile\r\n was a boy, and how he learned to love\r\n numbers.\r\n Andile was born in the city of Gqeberha, in the\r\n Eastern Cape.\r\n He lived with his mother and father. They stayed\r\n in New Brighton.\r\n Nearby, there was a village named Tyeni. His\r\n granddad stayed there.\r\nAndile loved to visit his granddad, who owned a\r\n cattle shed.\r\n Granddad would ask him, “How many males?\r\n How many females? How many cattle\r\n altogether?”\r\n Andile first learned how to count to 10 on his\r\n f\r\n ingers. Then to 20, on his toes! He could also\r\n count in 5s.\r\nIn the early morning, the cock crowed. It was 5\r\n o’clock when they woke up. They got ready to\r\n milk the cows.\r\n Later, they went to the nearby mountain to\r\n graze the cows.\r\n They read the time by the sun in the sky.\r\nDuring the day, his granddad would call him at\r\n 12 o’clock to come and eat. The sun was high in\r\n the middle of the sky.\r\n He knew it was time to go home when the sun\r\n set.\r\n He would count the cows to check that all had\r\n returned.\r\nWhen Andile started school, his father bought\r\n him a watch.\r\n He used his watch to count in 2s, 3s, and 4s.\r\n His watch had numbers from 1 to 12.\r\n Andile could read the arrows on the watch to tell\r\n the hour, half past the hour, and the minutes.\r\n Andile could count numbers in his mind. He\r\n could count forward and backward in his head.\r\n He could count and name the days of the week\r\n and the months of the year, in their order.\r\n When the cows gave birth, Andile would multiply\r\n and count the young ones.\r\nOn Fridays, he would pack his bag to visit\r\n granddad. He stayed there Saturday and\r\n Sunday.\r\n On Monday, he would go home and back to\r\n school.\r\n When school closed, he visited granddad.\r\n When Andile first went to school, they counted\r\n with stones and sticks.\r\n He used his fingers to write on the ground. He\r\n practiced adding numbers in the dust.\r\n The classroom was under the tree. When it\r\n rained, they could not go to school.\r\nWhen the boy from Brighton grew up, he went to\r\n university to study mathematics. He studied for\r\n many years.\r\n Today, Andile Mji works in a field of mathematics\r\n called statistics.\r\n He can still tell time like in the past, using the\r\n sun.\r\nToday, Andile is Professor Mji. He uses his\r\n f\r\n ingers to type on a computer.\r\n He uses numbers and graphs to tell stories. He\r\n uses mathematics to solve problems.\r\n He uses statistics to answer questions like, ‘What\r\n is the average age of children at this school?’\r\nProfessor Mji works with computers and\r\n numbers.\r\n He says, “Computers are very useful, but\r\n sometimes they crash! My knowledge stays with\r\n me in my head until the end.\r\n In mathematics, nothing changes. The numbers\r\n stay the same.”\r\n Professor Mji has a message for you:\r\n “To know mathematics, you must practice\r\n working with numbers.\r\n Mathematics is knowing ‘how to’. Mathematics is\r\n methods.\r\n You must learn to think with numbers. Then, you\r\n will be a hero!”\r\n——Questions\r\n 1. How did Andile first learn about\r\n numbers and counting?\r\n 2. Is it necessary to know how to do\r\n maths without a computer or\r\n calculator? Explain your answer.\r\n 3. Count to 12 in multiples of 2, then 3\r\n and then 4. Then, count backwards!",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/17._andile_mji_and_the_taste_of_numbers_layout/",
    "pdf_file": "2024/2/pdf/ndile_mji_and_the_taste_of_numbers-layout.pdf",
    "image_file": "29_02_2024-18_54_23~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "12"
  },
  {
    "id": "316",
    "postid": "316",
    "title": "Farm animals",
    "description": "Farm animals:\r\n Little Zebra Books;\r\n Marleen Visser",
    "long_story": "Dog\r\nDuck\r\n Cow\r\nDonkey\r\nMouse\r\nCat\r\nSheep\r\nGoat\r\nPig\r\nChicken",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/16._farm_animals/",
    "pdf_file": "2024/2/pdf/farm_animals.pdf",
    "image_file": "29_02_2024-18_34_43~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "10"
  },
  {
    "id": "315",
    "postid": "315",
    "title": "Eat all colours!",
    "description": "Eat all colours! :\r\n African Storybook;\r\n Pixabay Website",
    "long_story": "Did you know, when you\r\n eat fruits you are eating\r\n colours?\r\nWhat colour is an\r\n apple?\r\n Eat all types of apples.\r\n Eat green, red, yellow\r\n and pink apples!\r\n What colour is a\r\n coconut?\r\n Eat every type of\r\n coconut.\r\n Eat fresh coconut and\r\n dried coconut.\r\nWhat fruits are the\r\n colour orange?\r\n When is an orange the\r\n colour green?\r\n Watermelon is pink.\r\n Pink is my favourite\r\n fruit!\r\n You eat colours, when\r\n you eat fruits.\r\nAn avocado is a fruit\r\n with only one large\r\n seed.\r\n What colour are you\r\n eating when you eat an\r\n avocado?\r\nWhat colours are these\r\n peppers?\r\n Every kind of pepper is a\r\n fruit.\r\n Fruits are different to\r\n vegetables.\r\nFruits grow from flowers\r\n on a plant.\r\n Fruits have seeds.\r\n Which fruits do you like\r\n to eat?",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/15._eat_all_colours/",
    "pdf_file": "2024/2/pdf/eat_all_colours%21.pdf",
    "image_file": "29_02_2024-18_28_40~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "8"
  },
  {
    "id": "314",
    "postid": "314",
    "title": "How colours came together in  the sky",
    "description": "How colours came together in\r\n the sky by\r\n Zainab Ayoza Omaki and\r\n Offei Tettey Eugene",
    "long_story": "One day after a heavy\r\n rain, Iman looked\r\n across the sky and saw\r\n colours in it for the first\r\n time.\r\n\"How beautiful,\" she\r\n thought.\r\n Someone must have\r\n worked very hard,\r\n painting the sky with a\r\n brush like Daddy paints\r\n houses.\r\n She ran to her sister\r\n and said, \"Zarah look!\r\n Someone has painted\r\n the sky for us and made\r\n it beautiful.\"\r\nBut Zarah said, \"No,\r\n silly. That is a rainbow.\r\n You are little and I am\r\n big. I know why it is in\r\n the sky. Let me show\r\n you.\"\r\nZarah took Iman to the\r\n zoo.\r\n She said, \"Rainbows do\r\n not appear because lion\r\n cubs roar for the first\r\n time or because\r\n elephants are born.\"\r\nShe took Iman to a field\r\n of flowers and said,\r\n \"They do not appear\r\n because butterflies lose\r\n their colours in the\r\n clouds.\"\r\nShe showed Iman a\r\n book.\r\n She said, \"They do not\r\n even appear because\r\n rhinos run across the\r\n ground and scare\r\n colours up into the sky.\"\r\n\"I know why rainbows\r\n really appear. Mummy\r\n told me and now I'll tell\r\n you.\"\r\n Zarah took Iman's hand\r\n and led her to a\r\n playground.\r\n \"Rainbows appear in\r\n the sky because of\r\n children like you and\r\n me. One day, colours\r\n looked down from\r\n above and liked what\r\n they could see.\"\r\n\"They saw children with\r\n light skin, dark skin and\r\n everything in between.\r\n They thought, 'How\r\n wonderful it must be to\r\n be as beautiful as\r\n these.'\"\r\n \"They came together in\r\n the sky and spoke about\r\n what they could do.\r\n They decided, 'If we are\r\n to be beautiful we must\r\n do it as a group.'\"\r\n\"Now they join together\r\n and shine as brightly as\r\n they can. Hoping to be\r\n as beautiful as the\r\n children they see, just\r\n like you and me.\"",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/14._how_colours_came_together_in_the_sky/",
    "pdf_file": "2024/2/pdf/how_colours_came_together_in_the_sky.pdf",
    "image_file": "29_02_2024-18_23_40~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "9"
  },
  {
    "id": "313",
    "postid": "313",
    "title": "Counting cabbages",
    "description": "Counting cabbages by\r\n Penelope Smith and\r\n Magriet Brink",
    "long_story": "Mama K has been harvesting\r\n cabbages all week. Doobie, Maya and\r\n Duksie help Mama K in her vegetable\r\n garden on Saturday mornings.\r\n Today the children are going to help\r\n with counting and packing the\r\n cabbages. Then Baba K will take\r\n boxes of cabbages to sell at the\r\n market.\r\nThe taxi drops off the children at the\r\n garden gate. They can see the huge\r\n heap of cabbages piled up near Baba\r\n K's old truck.\r\n \"Yo! What a lot of cabbages!\" says\r\n Maya pointing. \"There must be a\r\n thousand cabbages there!\" laughs\r\n Duksie. \"No way! Two hundred at the\r\n most!\" disagrees Doobie.\r\n Mama K is waiting at the gate. \"Hello\r\n everyone, I'm happy to see you!\" she\r\n greets the children.\r\n \"Now let's get to work. You'll need to\r\n count the cabbages and put them into\r\n boxes, 12 cabbages in each box. I\r\n have 20 boxes. Two of you can each\r\n pack 7 boxes and one of you can pack\r\n 6 boxes.\"\r\nThe children stand around the pile of\r\n cabbages. They talk about different\r\n ways to count the cabbages.\r\n \"I think I will count mine in 2s,\" Maya\r\n says. \"I like counting in 4s,\" says\r\n Duksie, \"it's quicker.\"\r\n \"I'm going to count in 3s, just to be\r\n different!\" pipes up Doobie.\r\n\r\nSoon the children have filled 20 boxes.\r\n \"Good work!\" exclaims Mama K.\r\n \"Look, there are some cabbages left\r\n over. My pigs love cabbages so let's\r\n share these with them,\" she suggests.\r\n \"How many cabbages did you pack\r\n into boxes? How many cabbages were\r\n left over?\" she asks the children.\r\n\r\nThe next job is to write the price on\r\n each box and then help Baba K load\r\n the boxes on his truck.\r\n They must put half the boxes on one\r\n side of the truck and half on the other\r\n side, to balance the load.\r\n \"We're almost done!\" says Baba K.\r\n \"Let's see, how many more boxes we\r\n must still put on each side to balance\r\n the load?\"\r\nSoon all 20 boxes are loaded onto the\r\n truck. Baba K warms up the engine\r\n and drives off to market.\r\n \"If I can sell all the boxes,\" he thinks to\r\n himself, \"I'll have enough money to fix\r\n the pig pen and get a surprise for the\r\n children!\"\r\nBack at the farm, Mama K and the\r\n children water plants and rake leaves.\r\n By twelve o'clock they are all tired.\r\n Mama K tells them, \"It's time for your\r\n treat. Can you guess what I have for\r\n you today?\"\r\nShe goes inside to fetch their surprise.\r\n The children wait patiently for her to\r\n return while they guess what she\r\n might bring them.\r\n When she comes down the path her\r\n apron pockets are bulging!\r\n\"Let's see if you guessed right! What's\r\n in store for you today?\" Mama K tips\r\n out her apron pockets and apples fall\r\n onto the table.\r\n \"See, I was right!\" Duksie squeals.\r\n Mama K tells the children, \"Now\r\n remember the rule. Share fair! No one\r\n to get more or less than the other!\"\r\nFirst the children count the apples in\r\n 2s.\r\n They count: 2, 4, 6, 8, 10, 12, 14, 16,\r\n and 1 apple left over. Altogether there\r\n are 17 apples.\r\n Next, they share out the apples\r\n equally. There are 2 apples left over.\r\n The children then put their apples in\r\n their bags to take home. How many\r\n does each child get?\r\n\"Let's cut the 2 apples to share\r\n between us,\" suggests Duksie.\r\n \"How many parts of the apple will we\r\n each get?\" asks Maya.\r\n \"I know the answer!\" smiles Doobie.\r\n Just then Baba K arrives home from\r\n market. The truck is empty and Baba\r\n K is smiling.\r\n \"I sold all the cabbages. Now I can fix\r\n the pig pen and buy you that soccer\r\n ball you wanted.\r\n \"Yay!\" shout the children.\"",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/13._counting_cabbages/",
    "pdf_file": "2024/2/pdf/counting_cabbages.pdf",
    "image_file": "29_02_2024-18_16_54~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "6"
  },
  {
    "id": "312",
    "postid": "312",
    "title": "Counting animals",
    "description": "Counting animals by\r\n Clare Verbeek and\r\n Rob Owen",
    "long_story": "One elephant is\r\n going to drink water.\r\nTwo giraffes are\r\n going to drink water.\r\nThree buffaloes and\r\n four birds are also\r\n going to drink water.\r\nFive antelopes and six\r\n warthogs are walking to\r\n the water.\r\nSeven zebras are\r\n running to the water.\r\nEight frogs and nine fish\r\n are swimming in the\r\n water.\r\nOne lion roars. He also\r\n wants to drink. Who is\r\n afraid of the lion?\r\nOne elephant is\r\n drinking water with the\r\n lion.",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/12._counting_animals/",
    "pdf_file": "2024/2/pdf/counting_animals.pdf",
    "image_file": "29_02_2024-17_44_47~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "5"
  },
  {
    "id": "311",
    "postid": "311",
    "title": "Fana and her animals",
    "description": "Fana and her animals by \r\n Foziya Mohammed and\r\n Jesse Breytenbach",
    "long_story": "Fana and her family live in Debre\r\n Birhan, a busy town in Ethiopia.\r\n Fana is a Grade 3 student.\r\n She is good-hearted and wise.\r\nFana loves animals. She has a\r\n cat, two hens, a goat and a dove.\r\n She spends time with these\r\n animals, feeding them, and\r\n playing with them.\r\n One day, Fana was playing in the\r\n school yard with her friends.\r\n She noticed some children\r\n throwing stones at doves. \"Why\r\n are they hurting the doves?\" she\r\n asked herself.\r\nShe stopped playing and ran\r\n towards the children who were\r\n throwing stones. At first her\r\n friends didn't understand what\r\n was happening, then they\r\n followed her.\r\n \"Stop throwing stones!\" shouted\r\n Fana.\r\nThe other children ran away.\r\n Fana caught the two injured\r\n doves. She saw wounds on their\r\n wings.\r\n She decided to take the two\r\n doves home to look after them.\r\nShe fed the doves. In the evening\r\n she told her family about how\r\n she saved the doves.\r\nIn the morning, Fana and her\r\n parents went to the clinic and got\r\n medicine for the doves.\r\n After a few days, the doves'\r\n wounds healed. Fana felt very\r\n happy.\r\nFana always tells her friends, \"I\r\n love animals. Animals help us\r\n and they are our friends. We\r\n must protect and preserve\r\n them.\"\r\nQuestions.\r\nWhere do Fana live with her family?\r\nHow many animals do Fana keep?\r\nWhere did Fana and the family get medicine for the birds.?\r\nName the animals that were injured/Fana saved?",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/11._fana_and_her_animals/",
    "pdf_file": "2024/2/pdf/s11_fana_and_her_animals.pdf",
    "image_file": "29_02_2024-17_38_58~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "6"
  },
  {
    "id": "310",
    "postid": "310",
    "title": "How Many",
    "description": "How many? by \r\n Clare Verbeek and\r\n Sandra McDougall",
    "long_story": "How many legs do two\r\n ladybirds have?\r\nHow many wings do\r\n four birds have?\r\nHow many horns do\r\n three rhinos have?\r\nHow many trunks do\r\n five elephants have?\r\n How many ears do\r\n seven dogs have?\r\nHow many tails do three\r\n monkeys have?\r\nHow many eyes do six\r\n cats have?\r\nHow many legs does\r\n one worm have?\r\n\r\nQuestions.\r\nHow many animals are mentioned in the story?\r\nHow many animals from the story have legs?",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/10._how_many/",
    "pdf_file": "2024/2/pdf/s10_how_many.pdf",
    "image_file": "29_02_2024-16_58_36~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "6"
  },
  {
    "id": "309",
    "postid": "309",
    "title": "Two hungry boys",
    "description": "Two hungry boys by \r\n Clare Verbeek and\r\n Bronwen Heath",
    "long_story": "Ben and Thabo are two\r\n hungry boys.\r\nGranny is making ten\r\n cupcakes. She puts\r\n them on a plate.\r\n Ben takes one cupcake.\r\n Thabo takes two\r\n cupcakes.\r\nBen takes four\r\n cupcakes. Thabo takes\r\n two cupcakes.\r\nBen takes four\r\n cupcakes. Thabo takes\r\n two cupcakes.\r\n\r\nQuestions.\r\nHow many people have been mentioned in the story?\r\nWhat is the name of the two boys?\r\nHow many cupcakes did granny make?\r\nHow many cupcakes did Thabo eat?\r\nHow many cupcakes are left for granny?",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/9._two_hungry_boys/",
    "pdf_file": "2024/2/pdf/s9_two_hungry_boys.pdf",
    "image_file": "29_02_2024-16_53_48~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "5"
  },
  {
    "id": "308",
    "postid": "308",
    "title": "My Egg",
    "description": "My Egg by \r\n Tintswalo Baloyi and\r\n Tintswalo Bellah",
    "long_story": "Where can I lay my egg?\r\n Can I lay it in a tree?\r\n Cluck! Cluck! Cluck! It\r\n will fall and break!\r\nWhere can I lay my egg?\r\n Can I lay it on the roof?\r\n Cluck! Cluck! Cluck! It\r\n will fall and break!\r\nWhere can I lay my egg?\r\n Can I lay it in the\r\n garden?\r\n Cluck! Cluck! Cluck! It\r\n will get wet when they\r\n water the plants!\r\nWhere can I lay my egg?\r\n Can I lay it in the pool?\r\n Cluck! Cluck! Cluck! It\r\n will rot!\r\n Where can I lay my egg?\r\n Can I lay it in the yard?\r\n Cluck! Cluck! Cluck! They\r\n will take it and eat it!\r\nI have been looking for\r\n a place to lay my eggs. I\r\n am tired.\r\n I see a nest there. I will\r\n lay all my eggs in it!\r\n This place is safe.\r\n I will nurse the eggs\r\n right here until they\r\n hatch!\r\nNow, I have six\r\n beautiful chicks.\r\n I am very happy.\r\n I count them every day!\r\n\r\nQuestions.\r\nWhere did the bird lay its egg?\r\nWhich sound is produced by the hen.?\r\nWhere do hen live?\r\nHow do we call a young one of a hen?\r\nHow many chicks did the hen hatch?",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/8._my_egg/",
    "pdf_file": "2024/2/pdf/s8_my_egg.pdf",
    "image_file": "29_02_2024-16_49_47~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "6"
  },
  {
    "id": "307",
    "postid": "307",
    "title": "Look at the animals",
    "description": "Look at the animals by \r\n Jenny Katz and\r\n Sandy Campbell",
    "long_story": "Look at the animals.\r\nThe cow says, \"Moo.\"\r\nThe goat says, \"Meh,\r\n meh.\"\r\nThe horse says, \"Neigh.\"\r\nThe pig says, \"Grunt.\"\r\nThe chicken says,\r\n \"Cluck.\"\r\nThe dog says, \"Woof.\"\r\nThe farmer says,\r\n \"Shhh!\"\r\nQuestions.\r\nHow many animals are mentioned in the story?\r\nMention different sounds made by the animals?\r\nWho is a farmer?\r\nWhere do domestic animals leave?",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/7._look_at_the_animals/",
    "pdf_file": "2024/2/pdf/s7_look_at_the_animals.pdf",
    "image_file": "29_02_2024-16_44_19~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "6"
  },
  {
    "id": "306",
    "postid": "306",
    "title": "Rainbow Fish",
    "description": "Rainbow Fish by \r\n Diana Tebeila",
    "long_story": "Long time ago, when fish had no\r\n colours, there was one fish\r\n named Pono. Its name means\r\n vision.\r\n Pono lived with other fish in the\r\n sea next to South Africa.\r\nOne day, Pono lifted its head out\r\n of the water.\r\n The fish saw the rainbow with\r\n beautiful colours.\r\n Pono liked the rainbow colours.\r\nPono greeted the rainbow and\r\n said, \"You are so beautiful with\r\n your bright colours. Please would\r\n you share your colours with me?\"\r\n The rainbow was happy and\r\n thanked the fish for the praising\r\n words.\r\nThe rainbow replied, \"I will share\r\n my colours with you and then\r\n you will be a rainbow too. I know\r\n we are going to be good friends.\"\r\n The rainbow blew on Pono and\r\n all the colours spread to the fish.\r\nPono was very happy to see its\r\n body with beautiful colours,\r\n looking like a rainbow. The fish\r\n thanked its friend.\r\nPono swam back under the\r\n water. All the fish were surprised\r\n to see Pono with beautiful\r\n rainbow colours on its body.\r\n The other fish gathered around\r\n Pono, who told them what\r\n happened.\r\nThe other fish asked if the\r\n rainbow could also share its\r\n colours with them.\r\n Pono told them that the rainbow\r\n was kind and helpful.\r\n All the fish lifted their heads out\r\n of the water to talk to the\r\n rainbow.\r\nThe rainbow asked each fish to\r\n choose its colours.\r\n The rainbow blew on the fish,\r\n and they became colourful.\r\n \"Thank you, rainbow!\" called the\r\n fish.\r\n And this is how fish came to have\r\n colours on their bodies.\r\n\r\nQuestions.\r\nWhat was the color of the fish long ago?\r\nWhat happened to pono when it lifted its head?\r\nWhat did Pono ask the rainbow?\r\nWhy was Pono happy?\r\nWhat was the character of the rainbow according to Pono?\r\nWhat did the rainbow ask each fish to do? \r\nWhat can we learn from the story?",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/6._rainbow_fish/",
    "pdf_file": "2024/2/pdf/s6_rainbow_fish.pdf",
    "image_file": "29_02_2024-15_52_54~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "4"
  },
  {
    "id": "305",
    "postid": "305",
    "title": "Can We Count Our Cats?",
    "description": "Can We Count Our Cats?\r\n\r\n Bubaali primary school by\r\n Jesse Breytenbach",
    "long_story": "How many cats?\r\n 0 Zero cats.\r\n No cats here!\r\nHow many cats?\r\n 1 One cat.\r\n A black cat is eating red\r\n meat.\r\nHow many cats?\r\n 2 Two cats.\r\n A white cat and a grey\r\n cat are sleeping.\r\nHow many cats?\r\n 3 Three cats.\r\n Three cats are playing\r\n in the kitchen.\r\nHow many cats?\r\n 4 Four cats.\r\n Four cats are Paul's\r\n friends.\r\nHow many cats?\r\n 5 Five cats.\r\n Five cats chase the dog.\r\n How many cats?\r\n 6 Six cats.\r\n Six cats waiting for the\r\n dog.\r\nHow many cats?\r\n 7 Seven cats.\r\n Seven cats playing in\r\n the compound.\r\nHow many cats?\r\n 8 Eight cats.\r\n Eight cats and one dog!\r\nA kitten is stuck in a\r\n tree!\r\n \"I will rescue you!\" says\r\n Paul.\r\n\"Mama, can we keep\r\n him?\"\r\n How many cats?\r\n 9 Nine cats.\r\n 2 11\r\n \"That is too many cats!\"\r\n says Mama.\r\n\r\nQuestions.\r\nHow many cats have been mentioned in the story?\r\nWhat is the name of the boy mentioned in the story?\r\nHow many animals did Paul have in total?",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/5._can_we_count_our_cats/",
    "pdf_file": "2024/2/pdf/s5%20can_we_count_our_cats_.pdf",
    "image_file": "29_02_2024-13_54_26~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "4"
  },
  {
    "id": "304",
    "postid": "304",
    "title": "Buttons",
    "description": "Buttons:\r\nAfrican Storybook",
    "long_story": "All of my buttons are\r\n circles.\r\nSome of my buttons are\r\n green.\r\nAll of my buttons are\r\n small.\r\nSome of my buttons are\r\n yellow.\r\nAll of my buttons are\r\n nice.\r\nSome of my buttons are\r\n red.\r\nAll of my buttons are\r\n shiny.\r\nSome of my buttons are\r\n blue.\r\nAll of my buttons are\r\n good.\r\nI like all my buttons.\r\n\r\nQuestions.\r\nWhat is the shape and colour of the buttons?\r\nName the colors of the buttons?\r\nWhy are buttons important?",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/4._%20buttons/",
    "pdf_file": "2024/2/pdf/s4_%20buttons.pdf",
    "image_file": "29_02_2024-10_57_32~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "4"
  },
  {
    "id": "303",
    "postid": "303",
    "title": "A Rainbow Tale",
    "description": "A Rainbow Tale by\r\nMimi Werna and\r\nEdwin Irabor",
    "long_story": "Udoo, Erdoo and Eryum gathered around\r\nmother. With plenty of love in her heart and\r\nher totem in her hand, mother cleared her\r\nthroat and began the story:\r\nThere was a little girl called Yana. Yana's\r\naunt told her about a pot of gold at the end\r\nof a rainbow. Yana was curious about that\r\npot.\r\nDid the pot contain gold coins, or lumps of\r\ngold in black rocks?\r\n\r\nYana imagined that if she looked at the sky\r\nlong enough, she would get some answers.\r\nShe smiled at the birds. She wondered how\r\nthe gold got into the pot.\r\nAnd, where at the rainbow's end would she\r\nfind the pot? Yana wished that she knew the\r\nexact spot!\r\nAs she thought about her rainbow quest,\r\nYana saw a green frog jumping in the\r\nbushes. She could not resist, she jumped\r\naround with the frog for a while.\r\nThen, checking the sky, she said goodbye to\r\nthe frog. Yana went on her way in search for\r\nthe end of the rainbow.\r\nShe began to think about the rainbow's\r\ncolours. In a flash, red came first to mind.\r\nShe recalled the day her family almost had a\r\nbad accident because a driver didn't stop at\r\na red light.\r\nYana was thankful because no one was\r\nbadly hurt, although they all had cuts and\r\nbruises. Everyone got a huge fright.\r\n\r\nAfter red, Yana thought of the colour\r\norange. She loved sweet oranges.\r\nSweet, sour and bitter were the tastes she\r\nexperienced while eating oranges.\r\nThinking about a sour orange made Yana's\r\nmouth taste sour! Yuck! Do you know that\r\ntaste?\r\n\r\nYana's thoughts moved from oranges to a\r\nbowl of dark indigo beans, and her stomach\r\nmade noises. She realized that she was\r\nhungry.\r\nHer rainbow quest would have to wait for a\r\nwhile. It was time to eat some food!\r\n\r\nShe ran into her aunt's kitchen. The air\r\ncarried the aroma of the fried chicken and\r\nfresh bread.\r\nYana washed her hands and her nose led\r\nher to the food. She ate a little chicken with\r\na large piece of bread, and then she drank\r\nwater.\r\nShe looked down at her dress. What a mess!\r\nStains from the chicken, and water spilled.\r\nSo she changed into a beautiful purple\r\ndress.\r\n\r\nLater, Yana and her aunt went out to the\r\npark together.\r\nThey lay on the grass with a book. Yana\r\neagerly peered into the pages itching to\r\nfinally know more about the hidden pot of\r\ngold.\r\nYana's aunt chuckled at her excitement and\r\nthey both burst into peals of laughter. They\r\nbegan to read the story together.\r\nIt was a tale about how the rainbow colours\r\ncame to the land of Tonota, and a little boy\r\ncalled Mpho.\r\nFor the longest time, the people of Tonota\r\nonly knew the green of plants and the brown\r\nof soil. But Mpho had dreams of clouds in\r\nglorious colours!\r\nHe told the elders about his dreams. They\r\nsaid, \"If you name the colours, we can bring\r\nthem to life.\"\r\n\r\nThe elders asked for the help of rainmakers\r\nfrom across the land, and they gathered\r\ntogether.\r\nMpho began thinking about the colours in\r\nhis dreams. Then, these words came to his\r\nmind, \"Red, blue, orange, yellow, purple,\r\ngreen, and indigo.\"\r\nThe colourful clouds filled the sky!\r\n\r\nThe clouds hung in the air, and the\r\nrainmakers formed a circle, holding hands.\r\nThe rainmakers looked up to the clouds and\r\nthe colours formed a beautiful arc.\r\nThis was Tonata's first rainbow! People\r\ncheered and rejoiced.\r\nAnd just then, Mpho noticed a pot at the end\r\nof the rainbow. A pot filled with gold!\r\n\r\n\"What an amazing rainbow story! Now I\r\nknow where to find my pot of gold!\"\r\nexclaimed Yana to her aunt.\r\nHer aunt smiled, happy she shared her\r\nfavourite childhood story with her niece.\r\n\"But, no more rainbow quests for you! The\r\npot of gold can only be found by accident!\"\r\n\r\nWith those words, mother finished her\r\nrainbow tale. Udoo, Erdoo and Eryum\r\njumped up and gave her a standing ovation.\r\nThen they held hands like the rainmakers,\r\npretending to make their own rainbow!\r\n\r\n\"Mother, does every land have its own\r\nrainbow story?\" asked Erdoo thoughtfully.\r\n\"Yes, my lovelies,\" said mother. \"Tonota's\r\nrainbow started with Mpho's dreams of\r\ncolourful clouds. And remember the Magical\r\nRainbow River and its rainbow ice-cream?\"\r\n\"Mmmm, rainbow ice-cream, that's my\r\nfavourite story,\" said Eryum looking at\r\nmother hopefully as the children gathered\r\naround her again.\r\n\r\nQuestions.\r\nHow many children did mother have?\r\nWhy was Yana curious about the pot?\r\nName the land mentioned in the story?\r\nName the seven colors of the rainbow?\r\nName the colors the people of Toronto knew of?",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/3._%20a_rainbow_tale/",
    "pdf_file": "2024/2/pdf/s3_%20a_rainbow_tale.pdf",
    "image_file": "29_02_2024-10_21_59~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "4"
  },
  {
    "id": "302",
    "postid": "302",
    "title": "Weather Book",
    "description": "Weather book by\r\nClare Verbeek and\r\nSandra McDougall",
    "long_story": "It is dry.\r\n\r\nThe sun is hot.\r\n It is windy.\r\nIt is cloudy.\r\nIt is cold\r\nIt is raining.\r\nThere is thunder.\r\nI see a rainbow.\r\n\r\nQuestions.\r\nWhen do we see a rainbow?\r\nHow many colors do a rainbow have ?\r\nWhat is an umbrella used for? \r\nWhen do we hang out clothes to dry?\r\nName the weather patterns mentioned in the story?",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/2._%20weather_book/",
    "pdf_file": "2024/2/pdf/s2_%20weather_book.pdf",
    "image_file": "29_02_2024-10_09_09~target001.png",
    "date_stamp": "2024-02-29",
    "likes": "5"
  },
  {
    "id": "301",
    "postid": "301",
    "title": "Who can count to ten",
    "description": "Who can count to ten?\r\n by Athieno Gertrude\r\nand Salim Kasamba",
    "long_story": "A long time ago, deep in the forests,\r\n King Leopard began to think about\r\n the future. He thought, \"I'm getting\r\n old and one day, I'm going to die. A\r\n wise ruler should pick a successor\r\n while still young and healthy.\"\r\n But how could King Leopard choose?\r\n He loved all the members of the\r\n animal kingdom the same!\r\n\r\nKing Leopard had an idea. He sent his\r\n messengers out into the forests. He\r\n told them to ask all the animals of the\r\n kingdom to come to the palace.\r\n He was going to have a big party and\r\n he was going to make an important\r\n announcement.\r\n Away the messengers ran, to all four\r\n corners of the forest.\r\n\r\n\r\nOn the night of the party, all the\r\n animals were at the palace. They sang\r\n and they danced and had a great\r\n time.\r\n After the moon had risen above the\r\n trees, King Leopard came and stood\r\n in the middle of the clearing. The\r\n animals stopped their singing and\r\n dancing. They listened quietly as their\r\n king began to speak.\r\n\r\nHe cleared his throat and said, \"I've\r\n been thinking that it's time for me to\r\n pick a successor. But because I love all\r\n of you equally, I can't decide who\r\n among you is most worthy. So, I have\r\n decided to let a contest decide for\r\n me.\"\r\n\r\n King Leopard held up a spear. He\r\n said, \"The first one among you who\r\n can throw this spear up into the sky\r\n and count to ten before it touches the\r\n ground, will be my successor.\"\r\n\r\n\r\n\r\nAs King Leopard finished talking, the\r\n animals heard a loud noise from\r\n behind them. They turned around and\r\n saw Elephant stomping through the\r\n crowd to the front.\r\n \"Move out of my way. I'm the biggest,\r\n I should be king,\" said Elephant\r\n\r\n\r\nElephant took the spear and held it up\r\n with his trunk. He put his head back\r\n and threw the spear up into the sky.\r\n \"One! Two! Three! Oh!\" Elephant cried.\r\n The spear hit the ground on the count\r\n of four. Elephant was angry and\r\n started stomping. King Leopard told\r\n him, \"You've had your chance.\" And so\r\n Elephant had to leave.\r\n\r\n\r\n\r\nAfter Elephant left, the animals\r\n started to talk excitedly amongst\r\n themselves. They were again\r\n disturbed by a loud noise coming\r\n from the back of the crowd.\r\n Boar came charging through saying,\r\n \"Get out of my way. Get out of my\r\n way. I'm going to be king. I've got the\r\n biggest muscles. I'm the strongest. I\r\n should be king.\r\n\r\n\r\n Boar leaned back, clenched the spear,\r\n and threw it into the sky. \"One! Two!\r\n Three! Four! Five! Oh!\" he shouted.\r\n The spear dropped on the count of\r\n six. He was so angry. He fumed and\r\n threw clouds of dirt into the air.\r\n Leopard told him \"Boar, you only\r\n throw once and you've had your\r\n chance.\" Boar had to leave.\r\n\r\nAfter that, the animals said, \"This\r\n contest is difficult! Elephant couldn't\r\n do it, and he's really big. Boar couldn't\r\n do it either, and he's really strong. No\r\n one can win this contest!\"\r\n Right about then, they heard another\r\n sound coming from the back of crowd.\r\n When the animals looked around,\r\n they couldn't believe their eyes.\r\n\r\n\r\nThey saw a big ape coming forward.\r\n As Ape moved, he chanted \"I can do it.\r\n I know I can do it. I can do it.\"\r\n Ape took the spear and he backed\r\n way up. He pulled his arm back,\r\n charged forward, leapt into the air\r\n and threw the spear into the sky.\r\n \"One! Two! Three! Four! Five! Six!\r\n Seven! Oh!\" cried Ape.\r\n\r\n\r\nThe spear hit the ground on the count\r\n of eight.\r\n Ape was upset. He was so angry that\r\n he started turning round, complaining\r\n and making all sorts of excuses.\r\n But King Leopard told him \"No, Ape,\r\n you only get one chance.\" And so the\r\n ape had to leave.\r\n\r\nSome of the animals turned and\r\n started to leave for home. As they\r\n were leaving, they saw a little\r\n antelope coming through the crowd.\r\n As she trotted, she said, \"Wait, wait.\r\n Let me try. I can do it. I can do it. Let\r\n me try.\"\r\n When the animals heard her words,\r\n they all started laughing.\r\n\r\nKing Leopard jumped up and shouted\r\n angrily, \"Stop it! Do not make fun of\r\n Antelope! Who is to say that small\r\n animals can't do things that big\r\n animals can do? If Antelope wants to\r\n have a chance, she will be given the\r\n same chance that all the other\r\n animals had. So stand back and let\r\n Antelope throw the spear.\"\r\n\r\n Antelope bowed to her king, turned\r\n and took the spear in her mouth. She\r\n backed up, and with all the strength in\r\n her tiny body she started running.\r\n When she reached the centre of the\r\n clearing, she jumped high.\r\n She took a deep breath, released the\r\n spear and shouted, \"Five and five is\r\n ten.\" The spear hit the ground.\r\n\r\nAll the animals were quiet. They were\r\n confused. King Leopard explained,\r\n \"Yes, Antelope! Five plus five is\r\n another way to get to ten. There is\r\n more than one way to count to ten.\"\r\n The contest was not to find the\r\n biggest or the strongest animal. It\r\n was a contest to find the smartest\r\n animal! That is how Antelope became\r\n queen when leopard died.\r\n\r\nQuestions.\r\nWho was the king of the animals?\r\nWhere did the animals live?\r\nWhy did the leopard decide to choose another leader?\r\nHow many animals took part in the competition?\r\nWhat lessons can we draw from the story?.",
    "category": "Children Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2/html/1._who_can_count_to_10/",
    "pdf_file": "2024/2/pdf/s1_who_can_count_to_ten_.pdf",
    "image_file": "27_02_2024-10_00_49~target001.png",
    "date_stamp": "2024-02-27",
    "likes": "5"
  },
  {
    "id": "300",
    "postid": "300",
    "title": "Cow with one horn",
    "description": "A story by: Khothatso Ranoosi and Marion Drew",
    "long_story": "Cow with one horn\r\n\r\nHeeeee! There is a beautiful cow at home.\r\nIt has only one horn, and no tail.\r\nIt is fat, with a big stomach.\r\nIt is a powerful cow.\r\nThe shepherd loves this cow the most.\r\nWhen the other cattle graze, this one eats alone.\r\nThis cow is a fighter. Other cows leave it alone.\r\nIf you met such a cow, what would you do?\r\n\r\nQUESTIONS\r\n1. How many horns does the cow have?\r\n2. Does the cow have a tail?\r\n3. Are there any cows in that home?\r\n4. If yes their are other cows in that home, do they leave it alone?\r\n5. If yes the other cows leave it alone, why do the other cows leave it alone?\r\n\r\nACTIVITY\r\n1. Drawing and colouring the cow with one horn and without a tail.\r\n2. Drawing and colouring the bird as seen in the pictures of the story.\r\nWhite bird\r\n3. Modelling a cow with a tail and a horn with two horns and a tail as seen in the picture of the\r\nstory.",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/21.Cow_with_one_horn",
    "pdf_file": "21.Cow_with_one_horn.pdf",
    "image_file": "09_06_2023-11_59_48~Screenshot 2023-06-09 at 11.58.45.png",
    "date_stamp": "2023-06-09",
    "likes": "8"
  },
  {
    "id": "299",
    "postid": "299",
    "title": "Crocodile and Dog",
    "description": "A story by: Ursula Nafula and Rob Owen",
    "long_story": "Crocodile and Dog\r\n\r\nOne day, Dog found eggs at the river\r\nDog put the ten eggs in his bag.\r\nDog looked after the eggs and kept them warm.\r\nCrocodile asked Dog, “Have you seen my eggs?”\r\nCrocodile asked all animals about her eggs.\r\nMeanwhile, the eggs hatched one by one.\r\nDog could not give the young crocodiles enough food.\r\nOne day, Crocodile heard the rumbling bellies of young crocodiles!\r\nCrocodile went inside and hit Dog with her tail.\r\nCrocodile chased Dog down the road.\r\nDog stopped and said to Crocodile, \"I am sorry!\"\r\nCrocodile forgave him and went to swim with her children.\r\n\r\nQUESTIONS\r\n1. Who saw eggs at the river?\r\n2. How many eggs belonged to the crocodile?\r\n3. How did mother crocodile discover that her young ones were inside the dog’s house?\r\n4. Mention two actions which crocodile did to the dog after discovering her young ones in the\r\ndog’s house?\r\n5. How did the dog warm the eggs?\r\n\r\nACTIVITY\r\n1. Writing the names of all the animals seen in this story on cards and display.\r\n2. Drawing and colouring the picture of the dog as seen in the story.\r\n3. Modelling a bag as seen in the picture of the story.\r\n4. Modelling a crocodile as seen in the picture of the story.\r\n5. Drawing the dog’s hut as seen in the picture of the story.",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/20.Crocodile_and_Dog",
    "pdf_file": "20.Crocodile_and_Dog.pdf",
    "image_file": "09_06_2023-11_57_03~Screenshot 2023-06-09 at 11.56.00.png",
    "date_stamp": "2023-06-09",
    "likes": "3"
  },
  {
    "id": "298",
    "postid": "298",
    "title": "Mother changes",
    "description": "A story by: Ursula Nafula and Catherine Groenewald",
    "long_story": "Mother changes\r\n\r\nWhen mother was younger, we visited her friends.\r\nShe took me to the market to buy vegetables.\r\nShe took my brother to town.\r\nShe taught me the names of plants.\r\nWhen mother grew older, her back bent.\r\nShe stayed home more and talked to our neighbour's\r\nchildren.\r\n\r\nShe fell sick more often.\r\nShe walked with difficulty.\r\nHer grandchildren went to visit her during holiday time.\r\nNeighbours brought her milk from the shop.\r\nWhen mother was  younger, she was  stronger.\r\nNow, mother is older, she is weaker.\r\n\r\nQUESTIONS\r\n1. What did they buy at the market with her mother?\r\n2. Her brother was taken where by her mother?\r\n3. Name any three things/changes happened when her mother became old?\r\n4. When was her mother visited by her grandchildren?\r\n5. Who brought milk for her grandmother?\r\n\r\nACTIVITY.\r\n1. Drawing the pet of the girl as seen in the second picture of the story\r\nDog\r\n2. Modelling a cow as seen in the picture inside the milk shop.\r\n3. Drawing a cow as seen in the picture inside the milk shop.",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/19.Mother_changes",
    "pdf_file": "19.Mother_changes.pdf",
    "image_file": "09_06_2023-11_51_20~Screenshot 2023-06-09 at 11.49.04.png",
    "date_stamp": "2023-06-09",
    "likes": "5"
  },
  {
    "id": "297",
    "postid": "297",
    "title": "Mother's phone",
    "description": "A story by: Janet Mburu and Ingrid Schechter",
    "long_story": "Mother's phone\r\n\r\nI woke up very early to get ready for school.\r\nMother was annoyed. I was too slow dressing up.\r\nI ate my breakfast quickly.\r\nI met my friends in school.\r\nI opened my school bag. Oops! I still had mother's phone! I returned it in the bag.\r\nIt was time to go home. I looked into my school bag.\r\nOops! Mother's phone was not in my school bag.\r\nI started crying. The teacher asked, \"What is the problem, Wanjiku?\" I could not talk. I covered my face\r\nwith my hand.\r\nFinally, I said, \"Mother's phone is lost.\" Teacher was surprised. We started looking for the phone.\r\nI danced around in class. \"Thank you teacher. Thank you teacher!\"\r\nI put mother's phone in my school bag. I said to myself, \"I will not play with mother's phone again.\"\r\n\r\nQUESTONS\r\n1. Why did she wake up very early?\r\n2. Why was her mother annoyed that morning?\r\n3. What got lost from her bag?\r\n4. What lesson did she learn at the end of the day?\r\n\r\nACTIVITY\r\n1. Writing the name colours of the school uniform of the pupils on cards.\r\nGreen Blue\r\n2. Painting the colours of the school uniform of the pupils.\r\nGreen Blue\r\n3. Modelling a phone as seen in the picture in the story.\r\nMaterials needed:- Plasticine, brushes, water colour, felt pens and manilla paper.",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/18.Mothers_Phone",
    "pdf_file": "18.Mothers_Phone.pdf",
    "image_file": "09_06_2023-11_44_59~Screenshot 2023-06-09 at 11.43.27.png",
    "date_stamp": "2023-06-09",
    "likes": "4"
  },
  {
    "id": "296",
    "postid": "296",
    "title": "Mr. Fly and Mr Big Head",
    "description": "A story by Dorothy Fetaru and Joshua Waswa",
    "long_story": "Mr Fly and Mr Big Head\r\n\r\nThis is Mr Fly.\r\nThis is Mr Big Head.\r\nMr. Big Head and Mr. Fly were friends.\r\nOne day, they went for a walk together.\r\nThey came to the edge of a river and argued with each other.\r\nMr. Fly said, \"You can't jump over this river!\"\r\n\"Yes, I can! It's you who can't!\" replied Mr. Big Head.\r\n\"You jump!\" said Mr Fly.\r\n\"No, you jump first,\" said Mr Big Head.\r\nSo Mr Fly flew across the river.\r\nThen Mr Big Head jumped into the river.\r\nBut his head was so big that he started to sink.\r\nMr Fly laughed, \"Hee hee!\"\r\nBut he laughed so much that his mouth tore in two from one side to the other!\r\n\r\nQUESTIONS\r\n1. Name the two friends mentioned in this story.\r\n2. Where did they go together as friends one day?\r\n3. What happened to Mr Big Head when he was crossing the river?\r\n4. What happened to Mr Fly when he was laughing?\r\n\r\nACTIVITY\r\n1. Drawing and colouring the pictures of the two friends as seen in the story.\r\n2. Drawing the river.\r\n3. Modelling the pictures of the two friends as seen in the pictures of the story.",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/17.Mr_Fly_and_Mr_Big_Head",
    "pdf_file": "17.Mr_Fly_and_Mr_Big_Head.pdf",
    "image_file": "09_06_2023-11_41_35~Screenshot 2023-06-09 at 11.39.18.png",
    "date_stamp": "2023-06-09",
    "likes": "6"
  },
  {
    "id": "295",
    "postid": "295",
    "title": "Ms Phone",
    "description": "A story by: Ursula Nafula and Marion Drew",
    "long_story": "Ms Phone\r\n\r\nShe is called Ms. Phone. Look at her!\r\nShe has five cell phones.\r\nWhen she wakes up, she arranges her mobile phones on the table.\r\nThe yellow one is for communicating with family.\r\nThe white one is for communicating with people at work.\r\nThe red one is for communicating with those who owe her something.\r\nThe pink one is for communicating with her best friends.\r\nThe purple one is for communicating with people who need her help.\r\nMs Phone likes people to be happy. She does not like fighting.\r\nShe lets the children watch television at her shop.\r\nShe visits the sick and the elderly in their homes.\r\nWhen she passes by, people shout out, \"Ms Phone! Ms Phone!\"\r\nThen she feels happy and says, \"I am Ms. Phone. Here, look at my phones!\"\r\nThat is Ms. Phone and her five mobile phones.\r\n\r\nQUESTIONS\r\n1. How many phones does Ms. Phone have?\r\n2. What kind of people does Ms. Phone visit at their homes?\r\n3. How does Ms. Phone use the white phone?\r\n4. What is the use of the purple phone?\r\n\r\nACTIVITIES\r\n1. Writing down the colours of the phones on cards and displaying them.\r\nYellow White Red Pink Purple\r\n2. Colouring the colours mentioned in the story.\r\nYellow White Red Pink Purple\r\n3. Painting the colours mentioned in the story.\r\nYellow White Red Pink Purple\r\nMaterials needed:- Manilla paper, Crayons, brushes, felt pens and water colour.",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/16.Ms_Phone",
    "pdf_file": "16.Ms_Phone.pdf",
    "image_file": "09_06_2023-11_37_52~Screenshot 2023-06-09 at 11.35.35.png",
    "date_stamp": "2023-06-09",
    "likes": "4"
  },
  {
    "id": "294",
    "postid": "294",
    "title": "My cat Koko",
    "description": "A story by: African Storybook, Marleen Visser",
    "long_story": "My cat Koko\r\n\r\nMy pet is a cat.\r\nShe is called Koko.\r\nShe is friendly and beautiful.\r\nMy brother Tom and I like playing with Koko. My mother likes watching us while we play with Koko.\r\nKoko is so playful. Koko likes playing with her little sisters while her mother is asleep. I like watching\r\nKoko playing with her sisters.\r\nWe all like watching Koko playing with butterflies.\r\nKoko keeps us busy during our free time.\r\nEveryone in our family loves Koko. My brother bought a present for her.\r\nThis made me very happy.\r\nKoko is always clean and smart. I feel good when I see Koko. She likes me too.\r\n\r\nQUESTIONS\r\n1. What is a pet?\r\n2. When does Koko play with her sisters?\r\n3. What does Koko do that keeps the family busy?\r\n4. Does everyone in the family loves Koko?\r\n\r\nACTIVITY\r\n1. Drawing the cat as seen in the last picture of the story.\r\n2. Modelling a cat.\r\n3. Reciting a poem:-\r\n\r\nI have a pet\r\nHer name is Koko\r\nShe is friendly and beautiful\r\nKoko is always clean and smart.",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/15.My_cat_Koko",
    "pdf_file": "15.My_cat_Koko.pdf",
    "image_file": "08_06_2023-14_43_19~Screenshot 2023-06-08 at 14.41.48.png",
    "date_stamp": "2023-06-08",
    "likes": "5"
  },
  {
    "id": "293",
    "postid": "293",
    "title": "My family",
    "description": "A story by Clare Verbeek and Kathy Arbuckle",
    "long_story": "My family\r\n\r\nMy brother is reading a school book.\r\nMy mother is reading a bible.\r\nMy sister is reading a recipe book.\r\nMy uncle is reading a newspaper.\r\nGranny is reading a magazine.\r\nMy little sister is reading a picture book.\r\nI am reading this book.\r\nSoon I will be able to read everything!\r\n\r\nQUESTIONS\r\n1. Who is reading a recipe book?\r\n2. Who is reading a magazine?\r\n3. What is little sister doing?\r\n\r\nACTIVITY\r\n1. Modelling a cup and a sufuria as seen in the pictures of the story.\r\n2. Writting the names of what the family is reading on cards and display.\r\nSchool book Bible Recipe book Newspaper Magazine Picture book\r\n3. Drawing a cup and a sufuria as seen in the pictures of this story.\r\nMaterials needed:-\r\nPlasticine/clay, Manilla paper, drawing pencils.",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/14.My_family",
    "pdf_file": "14.My_family.pdf",
    "image_file": "08_06_2023-14_39_51~Screenshot 2023-06-08 at 14.39.39.png",
    "date_stamp": "2023-06-08",
    "likes": "3"
  },
  {
    "id": "292",
    "postid": "292",
    "title": "Imagination",
    "description": "A story by Werna and Joe Werna",
    "long_story": "Imagination\r\n\r\nMy imagination is like a key that opens every door!\r\nIn my imagination, my umbrella has two handles so I can hold it with my sister.\r\nIn my imagination, there are superhero bees.\r\nSuper bees, who fly around in water just as easily\r\n...as they can fly in the air!\r\nIn my imagination, flowers grow in boots and sing.\r\nIn my imagination, every child has ice cream for supper.\r\n...and then falls asleep as flowers sing to a purple moon.\r\n\r\nQUESTIONS\r\n1. Why is this person imagining an umbrella which has two handles?\r\n2. From this imagination story, what should be given to a child during supper time?\r\n3. From the imagination, what should happen when a child is falling asleep?\r\n4. From this imagination story, what should happen to boots?\r\n\r\nACTIVITY\r\n1. Drawing and colouring the umbrella with two handles.\r\n2. Modelling an ice cream.\r\n3. Painting a flower.\r\nMaterials needed:- Crayons, Plasticine/clay, brushes, water colour.",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/13.My_Imagination",
    "pdf_file": "13 My_Imagination.pdf",
    "image_file": "08_06_2023-14_37_05~Screenshot 2023-06-08 at 14.36.52.png",
    "date_stamp": "2023-06-08",
    "likes": "5"
  },
  {
    "id": "291",
    "postid": "291",
    "title": "My Mom",
    "description": "A story by Merville Mabula",
    "long_story": "My Mom\r\n\r\nThis is me.\r\nI live with my mom, brother and sister.\r\nMy mom likes to cook.\r\nSometimes my mom visits her friends.\r\nWhen she is away, I clean the house and wash the dishes.\r\nWhen it is night time, my mom tells us to pray.\r\nWhen it is my birthday, my mom brings me something.\r\nI love my mom.\r\n\r\nQUESTIONS\r\n1. What is the hobby of his mother?\r\n2. Does his mother buy him something on his birthday?\r\n3. What do they do when it is night time?\r\n\r\nACTIVITIES\r\n1. Drawing and painting the boy and his mother.\r\n2. Drawing some of the items which can be seen in the story\r\nChair Table\r\n3. Writting the names of the colours which can be seen from the pictures in the story on cards.\r\nMaterials needed:-\r\nManilla paper, Crayons and Felt pens.",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/12.My_Mom",
    "pdf_file": "12.My_Mom.pdf",
    "image_file": "08_06_2023-14_34_36~Screenshot 2023-06-08 at 14.32.33.png",
    "date_stamp": "2023-06-08",
    "likes": "3"
  },
  {
    "id": "290",
    "postid": "290",
    "title": "New pussy cat",
    "description": "A story by Ritah Katetemera and Marleen Visser",
    "long_story": "New pussy cat\r\nEnglish\r\nProsy wanted a pussy cat.\r\nProsy's family went to visit the pussy cats.\r\nProsy wanted this cat. It was too big for her.\r\nTim wanted this kitten. It was too small for him.\r\nMum wanted this kitten. It was too quick for her.\r\nEveryone liked this kitten.\r\nThey took the kitten.\r\nEveryone is happy with the new pussy cat.\r\n\r\nQUESTIONS\r\n1. Where did they go Propsy and her family?\r\n2. What is a kitten?\r\n3. Why Propsy did not take home the cat she wanted?\r\n4. Why Tim did not take home the kitten He wanted?\r\n\r\nACTIVITIES\r\n1. Drawing a pussy cat.\r\n2. Modelling a pussy cat.\r\n3. Reciting a poem about pussy cat:-\r\n\r\nA pussy cat is a good pet\r\nSome pussy cats are big\r\nSome pussy cats are small\r\nSome pussy cats are very fast\r\nYou should choose the best pussy cat",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/11._New_pussy_cat",
    "pdf_file": "11._New_pussy_cat.pdf",
    "image_file": "08_06_2023-14_31_30~Screenshot 2023-06-08 at 14.29.25.png",
    "date_stamp": "2023-06-08",
    "likes": "4"
  },
  {
    "id": "289",
    "postid": "289",
    "title": "One hot Saturday afternoon",
    "description": "Story by Nombulelo Thabane and Wiehan de Jager",
    "long_story": "One hot Saturday afternoon\r\n\r\nIt was a very hot Saturday afternoon in December.\r\n\"Bontle and Mpho and Lerato, go out and play!\" Mme said to us. \"I don't want you under my feet.\"\r\nWe ran out of the house.\r\n\"Let's go to the river,\" Lerato said. \"It's cooler there.\"\r\n\"But Mme told us not to swim in the river,\" said Bontle.\r\n\"We won't swim,\" answered Lerato. \"We'll just play in the shade next to the water.\"\r\nBut playing libeke is hot work, even when you're under the trees next to the river.\r\nFirst, we took off our shoes. But we were still hot. Then we took off our shirts and skirts. But we were\r\nstill hot.\r\nWe put our feet in the river to cool off. Then we splashed each other.\r\nSoon we were soaked with water.\r\n\"Oh come on! Let's swim,\" said Mpho. \"Mme will never know.\"\r\nWe swam and swam and forgot about the time.\r\nThe sun started to go down, and the day began to cool.\r\nWhere were our clothes?\r\nWe looked under the trees. We looked on the bushes.\r\nWe looked everywhere.\r\nThere were some cows near the river, enjoying the sweet grass. Bontle looked up, \"Look at that cow\r\nWhat's in her mouth?\"\r\n\"She's eating a red flower,\" said Lerato.\r\n\"It's not a red flower,\" shouted Mpho. \"It's your shirt!\"\r\nWe looked at another cow who was chewing something blue.\r\n\"That's my skirt!\" shouted Bontle.\r\nWe went home in our panties, shivering. But not only because it was cool.\r\n\"It was the cows,\" we cried. \"The cows ate our clothes.\"\r\nBut did Mme believe us?\r\nSoon our bottoms were very warm. And it wasn't from the sun.\r\n\r\nQuestions\r\n1. What was the month and the day of the incident?\r\n2. Where did they go?\r\n3. Write the activities they did after arriving at the river in order.\r\nACTIVITIES\r\n1. Drawing the animal which ate the children’s clothes at the river.\r\n2. Drawing the river and the sun.\r\n3. Modelling the animal which ate their clothes.\r\n4. Make masks of the animal and immitate its sound while wearing the\r\nmask.\r\n\r\nmaterials needed:- manilla paper, clay/plasticine",
    "category": "Story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/10._One_hot_Saturday_afternoon",
    "pdf_file": "10._One_hot_Saturday_afternoon.pdf",
    "image_file": "08_06_2023-14_18_17~Screenshot 2023-06-08 at 14.16.53.png",
    "date_stamp": "2023-06-08",
    "likes": "3"
  },
  {
    "id": "288",
    "postid": "288",
    "title": "Otoyo",
    "description": "Story by Joan Chepkorir & José Jochicala",
    "long_story": "Otoyo\r\n\r\nThis is Otoyo. He is eight years old.\r\nHe is in standard three.\r\nOtoyo has a sister.\r\nHe loves her very much.\r\nOtoyo and his sister play with their friend Akinyi on weekends.\r\nOtoyo lives with his parents and his grandparents.\r\nOtoyo goes to Umoja Primary School.\r\nHe likes school very much.\r\nOtoyo works hard.\r\nHe likes his teacher\r\nOtoyo's father is a game warden.\r\nHe takes them to the animal park.\r\nOtoyo goes to church with his parents.\r\nHe likes singing.\r\nOtoyo likes drawing pictures.\r\nHe loves his life.\r\n\r\nQuestions\r\nWhat class is Otoyo in?\r\nWhat does Otoyo’s father do for a living?\r\nWhat does Otoyo do over the weekend?\r\n\r\nACTIVITY\r\n1. Drawing some of the wild animals in the story.\r\n2. Colouring the colours of the flag as in the story.\r\n3. Drawing the picture which Otoyo is drawing.\r\n4. Writing the names of the wild animals in the story on cards.\r\n\r\nMaterials needed:- Crayons, Manilla paper",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/9.Otoyo",
    "pdf_file": "9._Otoyo.pdf",
    "image_file": "08_06_2023-14_15_39~Screenshot 2023-06-08 at 14.13.57.png",
    "date_stamp": "2023-06-08",
    "likes": "4"
  },
  {
    "id": "287",
    "postid": "287",
    "title": "Our world",
    "description": "A story by Ursula Nafula & Herminder Ohri",
    "long_story": "Our world\r\n\r\nGod wanted someone to take care of the world.\r\nLion volunteered, \"I am the king, I can do that.\"\r\nElephant shouted, \"I am big. I am right for the job.\"\r\nShark thought his sharp teeth made him the right one.\r\nEagle laughed, \"I fly and see everything. I am fit.\"\r\nGod said, \"I will create humans for this job.\"\r\nGod created men and women with black skin.\r\nOthers had brown skin.\r\nOthers had yellow skin.\r\nOthers had pink skin.\r\nShark laughed at the humans, \"How will they swim?”\r\nGod smiled, \"They will learn.\"\r\n\r\nQUESTIONS\r\n1. Which animal volunteered to take care of the\r\nworld?\r\n2. Who was the king?\r\n3. Name the animals you can see in the pictures of\r\nthis story?\r\n\r\nACTIVITY\r\n1. Drawing the animals.\r\n2. Modelling the shape of the world/earth.\r\n3. Modelling some of the animals.\r\nmaterials needed:- Felt pens, clay/plasticine.",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/8._Our_world",
    "pdf_file": "8._Our_world.pdf",
    "image_file": "08_06_2023-14_12_48~Screenshot 2023-06-08 at 14.12.28.png",
    "date_stamp": "2023-06-08",
    "likes": "4"
  },
  {
    "id": "286",
    "postid": "286",
    "title": "Rafiki's style",
    "description": "Story by Louis Greenberg & Audrey Anderson",
    "long_story": "Rafiki's style\r\n\r\nOn Sunday, Jimmy Zogba scored the winning goal.\r\nOn Monday, the Cool Cat Crew strutted by.\r\n\"Hey, Rafiki, where's your zebra hair? Your hair's so plain, like you don't care.\"\r\n\"Hey, Rafiki, where's your fake tattoo? Your skin's so boring. You are too.\"\r\n\"Hey, Rafiki, where's your bling? Your teeth are wonky, that's the thing.\"\r\nThat day, Rafiki walked home slowly.\r\n\r\n\"Auntie, can I have zebra hair?\" \"I can't cut you zebra hair. Actually, I wouldn't dare.\"\r\n\"My skin's so boring, Sisi. Can you make a fake tattoo?\" \"You don't need one to look like you.\"\r\n\"Mkhulu, I wish I had some bling.\" \"Bling, my child, don't mean a thing.\"\r\nThe next weekend, Santi Ramires scored the winning goal.\r\nOn Monday, the Cool Cat Crew strutted by. \"Hey, Rafiki! Looking fine!\"\r\nRafiki shrugged. \"I look like me; this style is mine.\"\r\n\r\nQUESTIONS\r\n1. Who scored the winning goals?\r\n2. Who had a fake tattoo?\r\n3. Who had zebra hair?\r\n4. What was the best hair style?\r\n\r\nACTIVITY\r\n1. Drawing and colouring a ball.\r\n2. Colouring the colours of the zebra.\r\n3. Reading the story aloud.",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/7._Rafiki_s_style",
    "pdf_file": "7. _Rafiki_s_style.pdf",
    "image_file": "05_06_2023-21_53_17~Screenshot 2023-06-05 at 21.49.15.png",
    "date_stamp": "2023-06-05",
    "likes": "4"
  },
  {
    "id": "285",
    "postid": "285",
    "title": "Rainbow visits the village",
    "description": "Story by Ursula Nafula & Wiehan de Jager",
    "long_story": "Rainbow visits the village\r\n\r\nMy name is Kobole.\r\nI live in a small village.\r\nOne day, I was out picking fruits.\r\nI saw something I had never seen before.\r\nThere were colourful lines in the sky.\r\nI dropped all the fruit and ran to tell people at home.\r\nPeople were standing outside surprised.\r\nI said happily, \"It is a beautiful sheet hanging from the sky.\"\r\n\"No! I think someone is pouring paint from the sky,\" Neno said\r\nSome people agreed with me. Others thought Neno was right.\r\nWe began to argue.\r\n.\r\nA man from a faraway village said, \"You are all wrong.\"\r\nWe shouted, \"Tell us then what it is if we are wrong.\"\r\nThe stranger said, \"It is the rainbow. Have you never seen the rainbow before?\"\r\nWe asked the stranger, \"Rainbow? What is a r-a-i-n-b-o-w?\"\r\nNeno asked, \"Is it ours? Can we keep it here?\"\r\nWe never got answers to our questions because the man had left.\r\n\r\nACTIVITY QUESTIONS\r\nWhat was Kobole doing?\r\nWhat did Kobole see?\r\nWhen he saw the lines what did he do?\r\nWhat did the village people do?\r\n\r\nACTIVITIES\r\n1. Colouring the colours of the rainbow on cards.\r\n2. Arrange the colours of the rainbow using coloured cards from the top to the bottom.\r\n3. Arranging the colours of the rainbow from top to bottom on cards.",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/6._Rainbow_visits_the_village",
    "pdf_file": "6._Rainbow_visits_the_village.pdf",
    "image_file": "05_06_2023-21_45_51~Screenshot 2023-06-05 at 21.41.42.png",
    "date_stamp": "2023-06-05",
    "likes": "4"
  },
  {
    "id": "284",
    "postid": "284",
    "title": "Rats",
    "description": "A story by Little Zebra Books - Stephanie Simpson",
    "long_story": "Rats\r\n\r\nThere was a man who sold oil that he made in his house.\r\nAnd in his house were rats. Lots of rats!\r\nEvery day the rats looked at the oil and said, \"How can we get that oil?\"\r\nThe rats tried to put their mouths into the bottles.\r\nBut the bottle necks were too narrow.\r\nThe rats tried to tip over the bottles.\r\nBut the oil would not flow out\r\nThe rats had a meeting to discuss the problem\r\nOne rat said, \"Let's put our tails into the bottles. Then we can lick the oil off our tails.\"\r\nThat's exactly what the rats did. They put their tails into the bottles, and then licked the oil off each\r\nother's tails\r\nThe rats did this until they had licked up all the oil\r\nThe man of the house saw that all his oil was gone!\r\nAnd that was the end of it.\r\n\r\nQUESTIONS\r\n1. What did the rats see every day?\r\n2. Why were the rats unable to reach the oil using their mouth?\r\n3. Why did the rats decide to hold a meeting?\r\n4. How did the rats get the oil?",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/5._Rats",
    "pdf_file": "5._Rats.pdf",
    "image_file": "05_06_2023-21_39_38~Screenshot 2023-06-05 at 21.21.49.png",
    "date_stamp": "2023-06-05",
    "likes": "4"
  },
  {
    "id": "283",
    "postid": "283",
    "title": "Rooster cheats",
    "description": "A story by Ursula Nafula & Wiehan de Jager",
    "long_story": "Rooster cheats\r\n\r\nLong ago, animals lived together.\r\nThey met to choose a king\r\nRooster wanted to be king.\r\nHe lied that he had fire\r\nThe animals believed Rooster.\r\nThey chose him as king.\r\nThe rainy season came.\r\nEverything was wet and cold.\r\nRabbit asked, “Where do we get fire to warm ourselves?”\r\nMonkey said, “We get fire from the comb on Rooster’s head.”\r\nThe animals send Fox to collect fire from their king.\r\nFox went to take fire without waking up Rooster.\r\nFox put dry grass on the comb.\r\nIt did not burn.\r\n\"Wake up king Rooster! We need fire now,\" shouted Fox.\r\nRooster did not have fire to give to Fox.\r\nFox was angry.\r\nFrom that day, foxes eat roosters.\r\n\r\nQUESTIONS\r\nWho wanted to be king\r\nWhy did they choose rooster to be king?\r\nWho went to collect fire from the rooster?\r\nWhy do foxes eat roosters?\r\nACTIVITIES\r\na. DRAWING AND COLOURING THE ANIMALS\r\nb. IMITATING THE SOUNDS OF THE ANIMALS",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/4._Rooster_cheats",
    "pdf_file": "4._Rooster_cheats.pdf",
    "image_file": "05_06_2023-21_13_52~Screenshot 2023-06-05 at 21.12.32.png",
    "date_stamp": "2023-06-05",
    "likes": "3"
  },
  {
    "id": "282",
    "postid": "282",
    "title": "School clothes",
    "description": "A story by Clare Verbeek & Mlungisi Dlamini",
    "long_story": "School clothes\r\nThis dress is long. It will make me fall.\r\nThis jersey is big.\r\nThis bag is big.\r\nThis belt is too small.\r\nThis hat is small.\r\nThe socks are short\r\nBut these shoes are new. Yeey!\r\nThey fit very well. I am so happy.\r\n\r\nQuestions\r\nWhich clothes were too big?\r\nWhich clothes were too small?\r\nWhat fits very well?\r\n2. Write the school uniform on cards and display them.\r\n3. Read loudly the words on the cards.\r\nMaterials needed:-manilla paper felt pens and Crayons",
    "category": "Stories",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/3._School_clothes",
    "pdf_file": "3._School_clothes.pdf",
    "image_file": "05_06_2023-21_03_02~Screenshot 2023-06-05 at 21.02.47.png",
    "date_stamp": "2023-06-05",
    "likes": "5"
  },
  {
    "id": "281",
    "postid": "281",
    "title": "Serious Accident",
    "description": "A story by Clare Verbeek and Rob Owen",
    "long_story": "Serious accident\r\nOne day my sister and I were walking near the road.\r\n\r\nA big truck was driving down the hill\r\n\r\nA car was speeding up the hill\r\n\r\nThe truck driver was talking on his mobile phone. He was not looking at the road\r\n\r\nThe truck smashed into the car!\r\n\r\nAn ambulance and the police came to help.\r\n\r\nTwo tow trucks came. One towed the truck. The other towed the car.\r\n\r\nWe saw everything.\r\n\r\nWe were shocked\r\n\r\nQuestions.\r\n\r\nWho was walking down the road?\r\n\r\nWho was talking on the phone?\r\n\r\nWho was speeding down the hill?\r\n\r\nWhat happened on the road?\r\n\r\nActivities\r\n1.ROLE PLAYING\r\n2.Drawing (colouring) the colours of the traffic lights.\r\n3.Drawing the policemen and their car.\r\n4. Modeling the van using clay or plasticine.\r\nMaterials needed; Crayons/colouring pencils, manila paper and plasticine/clay.",
    "category": "Story",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "2024/2._serious_accident-",
    "pdf_file": "2._Serious_accident.pdf",
    "image_file": "05_06_2023-15_25_15~Screenshot 2023-06-05 at 15.05.23.png",
    "date_stamp": "2023-06-05",
    "likes": "4"
  },
  {
    "id": "274",
    "postid": "274",
    "title": "Colours of a rainbow",
    "description": "Learn the colours of a rainbow by: By  Caren Echesa and  Jesse Breytenbach",
    "long_story": "Colours of a rainbow\r\n \r\nA rainbow has seven colors \r\n \r\nThe first colour is red\r\nKamau is wearing a red shirt\r\n\r\nThe second colour is orange\r\nThis is an orange. What else can you see that is the colour orange?\r\n\r\nThe third colour is yellow\r\nThe yolk of an egg is yellow. What else can you see that is the colour yellow?\r\n\r\nThe fourth colour is green\r\nOur banana garden is green.\r\n\r\nThe fifth colour is  blue\r\nThe sky is blue.\r\n\r\nThe sixth colour is indigo\r\nThese berries are  the colour indigo.\r\n\r\nThe seventh colour  is violet\r\nMy dress is violet. Violet is my favourite colour.\r\n\r\n\r\nWhat is your favourite colour? \r\n\r\nActivity 1: Lets sign these colors\r\n- Yellow\r\n- Green\r\n- Red\r\n- Blue\r\n- Orange\r\n\r\nActivity 2: Name the colors of the rainbow",
    "category": "Learning",
    "base_url": "https://theactionfoundationkenya.org/somesha-kids/dashboard/documents/",
    "html_file": "colours of a rainbow - revised final.htm",
    "pdf_file": "colours_of_a_rainbow.pdf",
    "image_file": "rainbow.png",
    "date_stamp": "2022-02-01",
    "likes": "7"
  }
]
